[
  {
    "id": 1742043600,
    "title": "12 Rules for Life\r",
    "name": "12-rules-for-life",
    "author": "Jordan B. Peterson\r",
    "publisher": "Penguin Random House UK\r",
    "publisherURL": "https://www.penguin.co.uk/books/309610/12-rules-for-life-by-peterson-jordan-b/9780141988511\r",
    "photo": "../assets/readings/12-rules-for-life-by-jordan-b-peterson.png\r",
    "category": "personal development\r",
    "date": "16 March 2025\r",
    "desc": "A philosophical guide on foundational approaches to help live a better life supported with anecdotes from the author's personal life and clinical practice, science, religion, and fiction.\r",
    "tags": "[\"Personal development\", \"Philosophy\"]\r",
    "content": "![12 Rules for Life by Jordan B. Peterson](../assets/readings/12-rules-for-life-by-jordan-b-peterson.png)\r\n\r\nThis book covers 12 of the author's rules for life. Note \"The\" is purposely absent from the title, implying there are more.\r\n\r\nI list the 12 covered in this book with a short summary of each for my own reminder and ease of personal application.\r\n\r\nSuch a summary may abstract away the weight and/or worth of these rules. So I do recommend reading the actual book for more in-depth, convincing, and poetic points and examples.\r\n\r\n\r\n## Rule 1: Stand up straight with your shoulders back\r\n\r\nHigher serotonin levels with low octopamine levels characterise dominators of conflicts and hierarchies, which also begets a foundation for recurring success, and a strong physical posture reflecting the comfort from those ongoing wins.\r\n\r\nConversely, low serotonin levels with high octopamine levels characterise those that repeatedly lose conflicts, are lower in hierarchies, and are afflicted by stresses leading to feedback loops that can lead to agoraphobic behaviours and posture.\r\n\r\nA crustacean analogy, whose species long preceded humanity, discern at first sight the posture of potential mates to infer an individual's conflict and hierarchy dominance, with attraction going to those with strong postures, and those with weak ones being ignored.\r\n\r\nHumans do the same. Achieving success in human society means being able to overcome conflicts and network effectively in hierarchies. People discern and judge at first sight based on posture and other factors, to make a similar inference.\r\n\r\nSo rather than walk around with a hunched back, correct your posture, and let your serotonin levels rise.\r\n\r\n\r\n## Rule 2: Treat yourself like someone you are responsible for helping\r\n\r\nGiven that individuals have greater knowledge of themselves than others have of them, people may bear self-contempt based on knowledge of their own flaws that others do not see. This can then result in an innate tendency to care for others better than they would themselves.\r\n\r\nWhen we genuinely help others for their intended good, we typically do so with a sense of respect and responsibility. That same respect and responsibility should be applied to how we treat ourselves, regardless of the faults we know of ourselves.\r\n\r\nThe intended purpose is to adopt the right attitude to help yourself get onto a life trajectory whose benefits and pride outweigh your self-criticisms.\r\n\r\n\r\n## Rule 3: Make friends with people who want the best for you\r\n\r\nPeople are different, and whilst their actions may seem the same on the surface, the motivations behind them are not. For example, there are people who want help to rise out of their suffering, versus people who cling onto their suffering to validate their victim signalling. There are people who help others out of naivety, versus people who help others out of narcissistic malevolence.\r\n\r\nIt is easier for an individual to follow their vices, wallow in misery, and choose failure, than it is for them to shoulder the burdern of improving their conditions, even though the latter would have greater long term benefit. It takes more strength and effort to become better.\r\n\r\nSo surround yourself with those who genuinely strive for their own self-improvement, and expect for your relationships with them to not be easy. It is better than having an effortless relationship with someone who sees your self-improvement efforts as a fault.\r\n\r\n\r\n## Rule 4: Compare yourself to who you were yesterday, not to who someone else is today\r\n\r\nSpend your time questioning who you are and your obligations. Be mindful that your self-evaluations aren't so over-rationalised they render life endeavours meaningless, and also avoid the trap of undervaluing your positives and overvaluing your negatives. Also, watch how you frame things, re-framing your problems may also give you insight to an alternate course of action.\r\n\r\nTake the approach of making changes, which can be more easily accomplished by aiming small, such as doing things today that make you a bit better than the you of yesterday. It is a tactic to help avoid the scenario of aiming too large, then surrendering to the innate desire of shirking the responsibility of performing a big change. As times go on, you can slowly increase the benchmark for that change.\r\n\r\nTake that energy, time, and concern for other's progress, and spend them on improving yourself.\r\n\r\n\r\n## Rule 5: Do not let your children do anything that makes you dislike them\r\n\r\nParents have a fundamental duty to act as proxies for the real world by onboarding their children to understand socially permissible boundaries, and learn to self-regulate their own behaviour. This duty takes precedence over all other aspects of the parent-child relationship, because parental failure to properly discipline a child means the world will do it instead, and the latter may not be as patient nor kind.\r\n\r\nThe degree of social immersion can affect a person's sanity. So it is important to discourage behaviours that lead to alienation, developmental cessation, and becoming a social disgrace. Such actions include angrily crying (an act of dominance that can be dealt with via timeouts), punching / kicking / biting (unless its for self-defence), and being mentally immature.\r\n\r\nParenting is also about rewarding children for actions that will make them socially accepted and successful in the world.\r\n\r\n\r\n## Rule 6: Set your house right before you criticize the world\r\n\r\nWhen you encounter the inevitable suffering that life deals you, you have the choice to either be so outraged that you become nihilistic, resentful, and believing that your vengeance is a moral imperative to dish back out at the world. \r\n\r\nOr alternatively, you can choose to learn from the experience. This is the better attitude to take, because there's only doom if you think the world conspires against you. You can start by questioning how much you contribute to the problems in your life. \r\n\r\nIdentify the things (big and small) that you could and would change to make your life better. Deconstruct yourself, and let the harmful and unnecessary parts of yourself die.\r\n\r\nHave the humility to not blame the world, and take responsibility for your own failure. After that, you can move to doing things that you can speak honourably of.\r\n\r\n\r\n## Rule 7: Pursue what is meaningful (not what is expedient)\r\n\r\nPursuing what is expedient means selfishly following short-term gains on blind impulse. Characterised by immaturity and irresponsibility to get its way, it involves lying, cheating, stealing, deceiving, manipulating, and uses the tragedy of life to justify its morally questionable actions. Over many iterations of such pursuits, it produces a demonic character.\r\n\r\nThe antithesis of pursuing expedience is pursuing meaning, which maturely regulates its impulses in its aim towards a good that pays for the debt of one's own existence. It sacrifices the pleasures of today for a better tomorrow, and the process of doing so creates social contracts through sharing, trade, and trust, and thus increases personal reputation. By living in a manner that builds towards your greatest possible self, you can raise those around you.\r\n\r\n\r\n## Rule 8: Tell the truth--or, at least, don't lie\r\n\r\nA person makes \"life-lies\" to corrupt the world with their perception. Examples of life-lies are imposing ideologies, justifying one's own cynicism, and avoiding responsibility. Living an invisible life is another type of lie, because it suppresses one's own potential and leads to obliterating their life's meaning and realising what they could be. This is characterised by avoiding conflict, false smiling whilst doing what one is told, and not questioning authority.\r\n\r\nWillful blindness is the worst lie because it lazily drowns itself in rationalisation and refusing to admit when the lie is wrong. Speaking lies leads to a weak character, and life mows down weak characters.\r\n\r\nThe author cites Nietzsche: \"...a man's worth [ is ] determined by how much truth he could tolerate\" (p.223).\r\n\r\nIdentify discrepancies between what you do and say to identify your weaknesses when misbehaving and misspeaking. The author's technique involves dividing oneself into two parts, \"...one that spoke, and one, more detached, that paid attention and judged\" (p.205). It helps identify when you are lying, and helping to decide to tell the truth when you are unsure what to do.\r\n\r\n\r\n## Rule 9: Assume that the person you are listening to might know something you don't\r\n\r\nThe highest form of wisdom is the continual search for it, and this requires accepting that knowing what you know is nothing, because sometimes you have to change the way you understand everything. You can do this by smartly being quiet and listening in conversations. However, there are different types of conversations where listening and speaking serve different purposes.\r\n\r\nSome types of conversations do not strive for such higher wisdom. For example, participants in dominance-hierarchy conversations like politics and economy merely seek attaining victory from their perception, leading to neither side learning. Genuine conversation involves listening to others without prematurely judging, understanding what the speaker thinks of their problem, and how the speaker plans to fix it. \r\n\r\nIt is important not to \"steal\" the speaker's problem by trying to solve it, because it is something that they should solve. Even if solving the problem is the purpose, be mindful about solving it too early in the conversation, as it may be perceived as a desire to escape from the problem-solving effort of the discussion.\r\n\r\nTips from the author include outlining the previous speaker's ideas and feelings to their satisfaction of your accuracy (also for your own understanding). You can also advise the speaker what their information has done for you, how it changed your presuppositions, and think of new questions, before speaking for yourself.\r\n\r\n\r\n## Rule 10: Be precise in your speech\r\n\r\nBeing precise and specific is necessary to admit to a problem, because that is the start of the problem solving process. Thus failing to specify means to also fail to define success, failure, and yourself, which can lead to growing hatred towards the confusion and suffering from the ignored reality.\r\n\r\nPursuing such care and honesty early on even if it risks facing conflict, spares you from trouble later down the line and preserves longer term truth and peace. As a start, consciously define the conversation's topic, otherwise it risks digressing to topics on everything.\r\n\r\nCommunicate your feelings to confront those feelings, such as admitting what you want, and saying what you mean so you know clearly what you intend. Even when your efforts to be precise still result in leaving the tragedy intact, at least those efforts chase away the obscurities.\r\n\r\n\r\n## Rule 11: Do not bother children when they are skateboarding\r\n\r\nIt is important to prioritise encouraging the development of your competency, which makes you safer than efforts to overprotect you. If you are overprotected, then you are more likely to fail when something unexpected, dangerous, yet full of opportunity appears, which it inevitably does.\r\n\r\nOverprotective parenting is a pathological problem that threatens a child's enlightenment, articulation, rationality, self-determination, strength and competence. This problem is an old one, the author cites the Oedipal mother concept, but focuses on the aspect of it that involves robbing another's potential as immoral.\r\n\r\nOther than overprotective parents, people with profoundly anti-human spirits also apply ugly solutions that inhibit those chances for competency development for implementation reasons that seem like lies. The author's example is that of skatestoppers, which prevented children from skateboarding nearby and learning to be competent against danger.\r\n\r\nLet yourself and others test the limits, and to gain the strength to bring more to the table. Men toughen up by pushing themselves and pushing each other. Foster the independence of your children (and of yourself), even if it causes you emotional distress.\r\n\r\nWe all need playgrounds dangerous enough to still be challenging.\r\n\r\n**Side note**: Don't forget Rule 5. Everything in moderation.\r\n\r\n\r\n## Rule 12: Pet a cat when you encounter one in the street\r\n\r\nYour life and being (including as a static existence) requires becoming something more, or at least different, which is only possible for someone who is limited. But despite those limitations and the inevitable tribulations that life throws at you, if you pay attention even on a bad day, you may be fortunate enough to be offered small opportunities such as petting a cat or a dog. Enjoy those small moments that distract you, or make you laugh at the absurdity of existence.\r\n\r\n\r\n## Reflection\r\n\r\nThis book was name-dropped in the author's YouTube lectures and interviews, so I bought a copy to try it. It is the first non-technical book I read since university, so it was not an easy transition to go from my preferred reading of factual and \"to-the-point\" near-discussionless information, to wading through such philosophical and life-orientated lessons.\r\n\r\nAdmittedly, I nearly dropped the book early on where it discussed the difference between light and darkness, as I felt it lingered too much on that point. I powered through that and was rewarded with interesting anecdotes from the author's life and clinical practice. Being careful not to spoil, the most memorable example for me is when the author and his wife looked after a neighbour's neglected child.\r\n\r\nA part of me wished I had the knowledge in this book at an earlier age in life, but I do wonder if youthful impatience would have prevented me from reading and properly incorporating the lessons.\r\n\r\nThe book encourages you to improve your internal locus of control, by setting your mindset and life in a constructive direction. One recurring way it does this is by confronting people so corrupted by their own nihilism, that they denounce humanity whilst hiding behind a false guise of being anti-prejudice.\r\n\r\nAn excerpt:\r\n\r\n*\"Aim up. Pay attention. Fix what you can fix. Don't be arrogant in your knowledge. Strive for humility, because totalitarian pride manifests itself in intolerance, oppression, torture and death. Become aware of your own insufficiency--your cowardice, malevolence, resentment and hatred. Consider the murderousness of your own spirit before you dare accuse others, and before you attempt to repair the fabric of the world. Maybe it's not the world that's at fault. Maybe it's you. You've failed to make the mark. You've missed the target... And all of that is your contribution to the insufficiency and evil of the world. And, above all, don't lie\"* (p.198)\r\n\r\nThe book has a number of other wisdoms, but I'll list only a few of my favourites below. The rest you can read the book to discover.\r\n\r\n* The author gives arithmetic proof of the \"...genuine dominance of good over evil in the human heart\", in that people constrain evil across the generations (p.154).\r\n\r\n* If you do not know why someone did something, look at the consequences then infer the motivation.\r\n\r\n* \"If you will not reveal yourself to others, you cannot reveal yourself to yourself... It means that so much of what you could be will never be forced by necessity to come forward\" (p.212).\r\n\r\n* \"Set your ambitions, even if you are uncertain about what they should be. The better ambitions have to do with the development of character and ability, rather than status and power. Status you can lose. You carry character with you wherever you go, and it allows you to prevail against adversity\" (p.224).\r\n\r\n* \"...new genes in the central nervous system turn themselves on when an organism is placed (or places itself) in a new situation... You have to say something, go somewhere and do things to get turned on. And, if not ... you remain incomplete\" (p.212).\r\n\r\nIn summary, the book may be a difficult read for the philosophically uninitiated, but the lessons are good. Truthfully, I prefer to listen to the author's lectures and interviews. They have less content, but there's more conciseness, logical reasoning, and stronger engagement in video format.\r\n\r\n\r\n\r\n### Reference\r\n\r\n* **[12 Rules for Life by Jordan B. Peterson (2018)](https://www.penguin.co.uk/books/309610/12-rules-for-life-by-peterson-jordan-b/9780141988511)**\r\n\r\n\r\n\r\nClick **[here](https://github.com/makuharistudio/makuharistudio.github.io/blob/main/src/readings/2025-03-16.md)** for this reading page's markdown file in GitHub."
  }
]