[
  {
    "id": 1749996000,
    "title": "Mastery\r",
    "name": "mastery",
    "author": "Robert Greene\r",
    "publisher": "Profie Books\r",
    "publisherURL": "https://profilebooks.com/work/mastery\r",
    "photo": "../assets/readings/mastery-by-robert-greene.png\r",
    "category": "personal development\r",
    "date": "16 June 2025\r",
    "desc": "An exploration into how to determine your Life's Task and strategies to accomplishing it with anecdotes of the journeys of key historical masters.\r",
    "tags": "[\"Personal development\", \"Business\"]\r",
    "content": "![Mastery by Robert Greene](/src/assets/readings/mastery-by-robert-greene.png)\r\n\r\n\r\nThis book covers the author's strategies on finding your Life's Task and navigating the phases to achieve mastery for that task.\r\n\r\nIt was not until sometime into writing this post that I found the \"Concise\" versions of the author's books which render the summarising part of my effort essentially moot, but I continued to finish this post. I realised this when I was buying my next book, \"The Concise 33 Strategies of War\" and compared it to its non-concise version. Essentially, the author's standard books are what you want to read because they include more anecdotes, whereas the Concise ones are what you need as a portable guide.\r\n\r\nI highly recommend this book. So much so I feel like it should be mandatory high school reading. Or at least its principles be taught earlier on in life.\r\n\r\nThe first step is to fight off social conformity and other influences to find your own **\"Life's Task\"**, and to do it efficiently by throwing aside the past, false paths, and exhaustive fights over limited resources (p.26-32, 35-40). Extraordinary people are clearly loyal to their calling (p.45-46).\r\n\r\nThe second step is to get into an **Apprenticeship** phase to learn the basic rules and skills needed to achieve your Life's Task, starting by setting aside your ego to genuinely learn, gaining hands-on experience, and open yourself to criticism so you can improve (p.56-63). The author also emphasises that this phase is accelerated with two things: \r\n1. Having a good **mentor** who encourages your separation from them once you've learned all you need and remains a lifelong ally (p.100), and\r\n2. Being **socially intelligent** enough to let others live as they are without trying to change them (p.125, 130, 137), and effectively deal with people who have any negative behaviours threatening your pursuits including envy, conformism, rigidity, self-obsessiveness, laziness, emotional flip-flop, and passive aggressiveness (p.141-145).\r\n\r\nOnce you have a comprehensive understanding of the field, the third step is to experiment in a **Creative-Active** phase by going beyond the disengaged, conventional, and consumerist mindset of adulthood, and develop a child-like creative mindset (p.175-178). You get to this by choosing a **Creative Task** that maximises your skills, dropping your judgmentalism for a holistic perspective, developing strategies to persevere through lulls in enthusiasm, and allowing serendipity to be a part of your creative process (p.179-245).\r\n\r\nThe fourth step of **Mastery** is characterised by your having a high-level intuition of your field built on your deep immersion, knowledge, experience, emotional stability, and discipline which also lets you create connections with other disciplines and physically change the real world (p.261-269). It also involves developing one's own \"X factor\" that forges their path to mastery, which can take the form of primal sensing, leveraging your innate strengths, practicing until your skills are automatic, and investing time into the details (p.269-309).\r\n\r\nFailing to pursue mastery or deny its existence leads to feelings of powerlessness, disappointment, and enslavement to a false version of yourself which is constructed from other people trying to make you conform to their ideas, including your own self-deception that such mastery is only for geniuses. Do not waste your uniqueness. Find the most fundamental and natural inclinations you have, and express them as you pursue mastery (p.309-310).\r\n\r\nThis book feels like a sign post for those of us in the 99% of humanity who give up on ourselves, and shows how people who started off at the same or worse baselines than us, were able to craft themselves into masters. The principles and multitude of strategies in it are timeless, and really should be mandatory reading.\r\n\r\nAs a self-development book, this one felt more goal-orientated compared to the \"12 Rules for Life\" by Jordan Peterson which felt more for daily living. Though I prefer this book more for its ease of reading and its mission-based intent.\r\n\r\nLike most when I was young, I was fed the preconceptions of having to get into university and then get a job, with no questioning of why we had to do things that way. I feel it is more honest to say upfront that life is not a fixed path you have to follow, that opportunities are all around you no matter the age, and you need to seize them. That point is what makes this book work tremendously well.\r\n\r\nYou only have one life, and all the circumstances leading up to your existence were highly improbable, so use it for the core of who you are, not for what others want you to be.\r\n\r\nIn terms of anecdotes, my favourites included:\r\n\r\n* Leonardo da Vinci's study into single piece moulding of a bronze statue which was reminiscent of Elon Musk's idea for Tesla's chassis to be made of a single piece based on a toy car (p.24).\r\n\r\n* Cesar Rodriguez who trusted the process of training and pushing himself, going from a benched panicked pilot, to becoming nicknamed the \"Last American Ace\" fighter pilot (p.77).\r\n\r\n* William Harvey's approach of thoroughly experimenting his hypothesis before trying to push it onto others:\r\n  - He wisely confided his discoveries to the King early on to gain his trust and support.\r\n  - Behaved humbly and with self-deprecation\r\n  - Played the role of court diplomat and avoided aligning with any faction nor got involved in intrigue (p.150).\r\n\r\nThe book has a number of other wisdoms, but I'll list only 3 of my favourites below. You can read the book to discover more.\r\n\r\n1. \"In the future, the great division will be between ... those who can acquire skills and discipline their minds and those who are irrevocably distracted by all the media around them and can never focus enough to learn\" (p.64).\r\n\r\n2. \"The very desire to find shortcuts makes you eminently unsuited for any kind of mastery\" (p.90).\r\n\r\n3. \"The problem with all students, ...is that they inevitably stop somewhere. They hear an idea and hold on to it until it becomes dead; they want to flatter themselves that they know the truth. But true Zen never stops ... everyone must constantly be pushed to the abyss, starting over and feeling their utter worthlessness... Without suffering and doubts, the mind will come to rest on cliches and stay there, until the spirit dies as well...You must continually start over and challenge yourself\" (p.115). \r\n\r\n\r\n\r\n### Reference\r\n\r\n* **[Mastery by Robert Greene (2012)](https://profilebooks.com/work/mastery)**\r\n\r\n\r\n\r\nClick **[here](https://github.com/makuharistudio/makuharistudio.github.io/blob/main/src/markdown/readings/2025-06-16.md)** for this reading page's markdown file in GitHub."
  },
  {
    "id": 1745071200,
    "title": "Elon Musk\r",
    "name": "elon-musk",
    "author": "Walter Isaacson\r",
    "publisher": "Simon & Schuster\r",
    "publisherURL": "https://www.simonandschuster.com.au/books/Elon-Musk/Walter-Isaacson/9781761427978\r",
    "photo": "../assets/readings/elon-musk-by-walter-isaacson.png\r",
    "category": "biography\r",
    "date": "20 April 2025\r",
    "desc": "A chronicle of Elon Musk's journey from a difficult childhood to his successive founding of multiple industry-redefining companies up until the early establishing of X.AI in 2023.\r",
    "tags": "[\"Biography\", \"Technology\", \"Business\"]\r",
    "content": "![Elon Musk by Walter Isaacson](/src/assets/readings/elon-musk-by-walter-isaacson.png)\r\n\r\n\r\n\r\nThis book chronicles the biographee's life from a challenging childhood to the founding of multiple companies that revolutionised key technology industries.\r\n\r\nThis is the first biography I ever read, and it was difficult because I found the idea of biographies to be uncomfortably intrusive. However, my curiosity to understand how someone who has achieved so much in a single lifetime in multiple highly intellectual fields can possibly exist won me over.\r\n\r\nBefore reading this book, my initial knowledge on the biographee was very superficial as I had only seen a few interview clips on YouTube. After reading this book, I better appreciate how ridiculously rare he is as an individual, and can see why some conspiracy theorists and Internet meme creators may equate this rarity to him being an extraterrestrial. I am happy to have that superstitious veil lifted and to see the extreme effort and sacrifices needed to create a paragon of human endeavour.\r\n\r\nThe biographee been through many misfortunes that may otherwise be enough to cause other people to give into darker life paths. So to remain on his path in building the at-scale foundations for a better future despite these tribulations is amazing and proof he's living a full life:\r\n\r\n- Born into a country where daily fatal violence in public areas is the norm.\r\n- Physically bullied to near death as a child.\r\n- Impacted by a challenging relationship with a now estranged father since childhood.\r\n- Divorced mother who worked multiple jobs to make ends meet.\r\n- Unable to make friends until he started university.\r\n- Passing away of his first-born infant son.\r\n- His political enemies manipulating one of his other children, causing estrangement between them.\r\n- Romantic breakup leading to severe depression and impacting work performance.\r\n- An ongoing neck injury.\r\n- A seemingly chaotic-good alignment that constantly desires being in intense situations.\r\n\r\nThe problem with reviewing biographies is the misplaced tendency to judge the biographee as a person, rather than the biography as a book.\r\n\r\nSo, to get straight to it, the book is an engaging mix of dramatic, heartfelt, and humorous anecdotes. Whilst the author occasionally expresses misgivings like describing the biographee's ability to present his vision \"as a mandate from heaven\" (p.94), the overall narrative feels balanced because despite tensions, the author remains committed to presenting an honest account, allowing readers to interpret the contradictions for themselves.\r\n\r\nI've decided to encapsulate some of the business-related lessons from the book in areas like leadership, team dynamics, communication, etc. for ease of personal reference. This book has a multitude of other lessons in morality, integrity, relationships, politics, and more, but those and the anecdotes won't be covered here. Please refer to the book for that information.\r\n\r\n\r\n\r\n## PERSONAL MINDSET\r\n\r\n### Define who you are\r\nFind the thing you want to do which will have the most impact because pursuing that may be the best way to spend your life, rather than on something else you may enjoy doing or are good at but has low impact (p.56). Once you've identified that, then identify if you are okay working for other people to pursue it, or if you prefer having people work for you, so you can commit to that preference earlier on in life (p.48).\r\n\r\n### Learn by risk-taking\r\nDo not base your decisions out of fear of something, instead use the risk as your fuel to push yourself forward (p.25, 252). Even when your risk-taking fails, do your best to make every bad situation salvageable (p.116). When your risk-taking succeeds, don't waste the wealth earned from it into short-term pleasures that achieve nothing, invest it back into the game of life and play again (p.67).\r\n\r\n### Use objective and iterative problem-solving\r\nKnow when to step back from your emotions and to reframe a problem (p.99 & 247). Take an iterative approach and learn by failing with the attitude of quickly getting back up to identify each successive problem so you can fix them (p.114). Have the humility to accept being wrong, just don't be confidently wrong (p.286).\r\n\r\n###\t\"Polytopia life lessons\"\r\nPolytopia is a video game that the biographee recommended to his brother on learning how to be a CEO, and these are key lessons from the game (p.426-427)\r\n1.\tEmpathy is a liability in business.\r\n2.\t\"Play life like a game\".\r\n3.\tLosing is inevitable and will happen many times. Get used to it so you become fearless and take more risks.\r\n4.\tBe proactive and take charge of setting the strategy.\r\n5.\tOptimise every turn you have in life, and let nothing slide.\r\n6.\tPut everything back into the game to grow.\r\n7.\tPick your battles carefully by using front minimisation tactics.\r\n8.\tUnplug at times by removing distractions.\r\n\r\n\r\n\r\n## STRATEGY AND VISION\r\n\r\n### Define a broad business mission\r\nWhen your company mission is important enough, optimism and pessimism are irrelevant. All that matters is taking the steps forward to achieve the mission, then work backward to figure out how to make it work financially (p.177 & 93). Make the mission broad like an innovation company, which is also advantageous in that any future acquisitions or mergers will be less challenged for being in line with the core innovation mission (p.254-257).\r\n\r\n### Find entrepreneurial opportunities\r\nDo not let incumbent industry mindset inhibit you from seeing opportunities in that industry (p.48). For example, figure out the reasons why that industry isn't doing well, and simplify the process for the customer by taking on the legwork to fix those problems (p.252). Be open to other business models to side-fund your main model, like selling a component your supply chain makes to another business, tying different endeavours together into a new one, or using data collected for a new purpose (p.193, 243-244).\r\n\r\n### Build a company attitude of anti-complacency\r\nA \"maniacal sense of urgency\" is needed as an operating principle for companies to avoid being flabby and slow because complacency can be a scourge to business (p.286, 349, 508). If your company is already too conservative and long-lived, quickly accept that you need to change, and adopt entrepreneurial efforts (p.222).\r\n\r\n### Be a product company, not a sales nor a platform company\r\nA platform company is merely an unbranded vendor for incumbent industry leaders (p.63-65), and a sales company neglects the philosophy that you should make a great product then let the sales follow up by themselves after that (p.253). So, it is important to be product-first. For high-cost industries, you can create a high-price and quality iteration before designing a mass-market model (p.127). You can also more easily gain public awareness by displaying prototypes to the public (p.121, 194).\r\n\r\n\r\n\r\n## LEADERSHIP\r\n\r\n### Lead by example, not by empathy\r\nAn effective leader is like a general on a battlefield, they need hands-on experience on the factory floor and be willing to do what they asked of the workers, otherwise they shouldn't ask the workers to do those things in the first place (p.285-286, 480). They have the openness to take in the risk information and data from their team, the flexibility to have their mind changed by the evidence, the decisiveness to make quick assessments and shift responsibility from the team to themselves, and the resolve to take ownership for their mistakes even if it needs to be done publicly (p.210, 282, 407). It is not the leader's job to make people love them, as that just leads to counterproductivity (p.64).\r\n\r\n### Communicate with workers rather than executives\r\nSpend your time on the shop floor listening to the suggestions of floor workers to find problems to solve and get information regarding limits your company can go beyond, one way to implement this is by performing skip-level meetings so workers can bypass direct supervisors and have their ideas heard (p.157, 286, 328). Be willing to treat people politely and respectfully, as not treating them well may make them disinclined to tell you where the problems are (p.166).\r\n\r\n### Draw clear lines for segregation of duties\r\nBe clear to employees that duties precede relationships. For example, if you are trying to drive down costs, ensure your financial analysts understand they are not to befriend the engineers who set the costs, because the analysts need to serve as objective judges of the engineers (p.363). Enforce internal transparency and integrity by proactively asking and investigating staff so that you can find conflicts of interest that are being hidden because there is no incentive for those conflicts which threaten your operations to out themselves (p.571).\r\n\r\n### Proactively fight against analysis paralysis\r\nLeaders need to step in when analysis paralysis is happening, to make decisions that will move efforts forward fast by trying, failing, then fixing, instead of spending months on analysis prior to taking action (p.388).\r\n\r\n\r\n\r\n## TEAM DYNAMICS\r\n\r\n### Hire team members based on attitude over skills and experience\r\n\"When hiring, look for people with the right attitude. Skills can be taught. Attitude changes require a brain transplant\" (p.286). Prioritise candidates who have an attitude to work maniacally hard, but be wary of anyone whose confidence is greater than their competence (p.350, 512). If you want to have a hardcore, fanatic work culture, you need to have a staffing method that cuts to the bone (p.522).\r\n\r\n### Encourage team members to prioritise their feedback loops over comradery\r\nIt is inevitable that employees will need a good feedback loop and have the initiative to seek criticism from others to improve (p.365). Comradery can be dangerous because it makes it hard for people to challenge each other's work, creating a counterproductive tendency to avoid throwing colleagues under the bus, but that tendency needs to be avoided for improvement to begin (p.285).\r\n\r\n### Prepare the team to support a leader who is steering off the rails\r\nNo one is perfect, and even a leader can make severely bad decisions out of impulsive emotion. To handle this, have a team member inform them as such and have other team members raise it with them to show consensus. Then ensure the team quietly knows to avoid carrying out reactionary orders from that leader until the storm of emotion passes and when that leader is able to properly process the inputs (p.539).\r\n\r\n\r\n\r\n## PRODUCT DEVELOPMENT\r\n\r\n### Innovate by setting metrics as your goal post\r\nInnovative business ideas come from translating the inefficiencies of existing technologies as clear metrics, like the time take to manually type information into a computer or the cost per pound to get a payload into orbit, then working hard to improve that metric's value by advancing its underlying technology (p.93, 355, 399). The metric's value can be displayed on a large monitor, so the team can treat it like a game to try to improve it, making it also a measure for product engineering performance (p.596).\r\n\r\n### Initial product brainstorming\r\nFirst think of the materials used to build your product including the reasonings for those materials and the product's structure, then have the team members create a detailed chart of any functionality they want and the cost of manufacturing each at scale (p.316, 486).\r\n\r\n### Co-locate engineers with designers\r\nHave designers and engineers work together in the same room so they can have a \"throw-it-over-the-fence\" mentality such they think like the other, because true industrial design connects the beauty of a product to its engineering (p.79, 137, 200). Separating product design from engineering is a recipe for dysfunction, so ensure you have set things up such that designers feel immediate pain if something they devised is hard to engineer. For this reason, engineers should lead the design process rather than product managers (p.79).\r\n\r\n\r\n\r\n## MANUFACTURING\r\n\r\n### Empower assembly line teams using factory layout\r\nWhen designing a factory, make the layout so that an assembly line person can collar a designer or engineer and hold them accountable to bad designs (p.109). This can be achieved by placing the cubicles for the engineers beside the assembly lines, so they can see when something goes wrong and hear complaints if their design causes a slowdown (p.219). Make it a collective responsibility by corralling the engineers to frequently walk up and the down the assembly lines with you to assess the production line's efficiency, so if they find an aspect of product design is expensive to produce, it'll require changing the design (p.219, 390).\r\n\r\n### Inhouse your supply chain and minimise dependencies\r\nAlthough outsourcing may be cheaper, a poor international supply chain can be a logistical nightmare and can cause cash-flow problems (p.160). Key components should be made inhouse to control quality, costs, and supply chain, whilst aiming for vertical integration (p.132). In-housing can be further improved by pursuing good manufacturing process inspirations, like the cold casting mould method used for toy cars which removes the need to piece together hundreds of parts (p.338). You can also cleverly get 24 hours of production with 16 hours of human labour using machines and careful prediction of when human intervention would be necessary, which helps get around labour laws whilst maximising production time (p.158-159).\r\n\r\n### Challenge costs\r\nChallenge your suppliers on costs they charge on components, especially if there are equivalent cheaper components in other industries, or consider making it in-house at a fraction of the price (p.112). \r\n\r\n### Pursue efficiency via the \"Idiot Index\" and \"The algorithm\"\r\nThe **idiot index** identifies the economically problematic components in the production process, and **the algorithm** is a methodology to improve the production process itself.\r\n\r\nThe **idiot index** is \"...the ratio of the total cost of a component to the cost of its raw materials. Something with a high idiot index--say a component that cost $1,000 when the aluminium that composed it only cost $100--was likely to have a design that was too complex or a manufacturing process that was too inefficient...If the ratio is high, you're an idiot\" for not addressing it (p.363).\r\n\r\n**\"The algorithm\"** is a 5-point checklist (p.284-285):\r\n1. \"Question every requirement. Each should come with the name of the person who made it. You should never accept that a requirement came from a department... Then you should question it, no matter how smart that person is...Then make the requirements less dumb\".\r\n2. \"Delete any part or process you can. You may have to add them back later. In fact, if you do not end up adding back at least 10% of them, then you didn't delete enough\".\r\n3. \"Simplify and optimize. This should come after step two. A common mistake is to simplify and optimize a part or a process that should not exist\".\r\n4. \"Accelerate cycle time. Every process can be [ sped ] up. But only do this after you have followed the first three steps\", it is a mistake to automate first because some time accelerating processes may need to be removed altogether.\r\n5. Automate. This comes last in designing the production process. Wait until all requirements have been questioned, and all unnecessary parts and processes deleted.\r\n\r\n\r\n\r\n## NEGOTIATION\r\n\r\n### Stay calm against disruptive opening offers\r\nDuring a business negotiation, if your counterpart is exaggerating numbers and making an offer that would be considered illogical, be patient and consider the possibility that it is just their opening move, before walking away from the table entirely. Some people just like to play games (p.77).\r\n\r\n### Convince with tangible actions, not with words alone\r\nIf you have a potential partner hesitant to join forces with yours, one strategy is to physically demonstrate at a very large scale, that your side is willing to plough ahead with your endeavour even without the potential partner, like the building of a for-purpose factory (p.221).\r\n\r\n### Do due diligence for acquisitions\r\nWhen making a deal to buy out a company, make it contingent on full due diligence to minimise the trouble it would otherwise cause later (p.463).\r\n\r\n### Pursue outcomes and merit-based work\r\nCost-plus contracts are where you are paid for your costs plus guaranteed profit, which is ineffective as it is an incentive to never finish work. If such a system is in place, challenge it with outcomes-based fixed pricing where companies should be risking their own capital (p.123). \r\n\r\n\r\n\r\n## 3 OTHER USEFUL NOTES\r\n\r\n1. First principles thinking involves \"...drilling down to the basic physics of the situation and building up from there\" (p.99). Approach your problems using this mindset.\r\n\r\n2. One way to show you are listening in meetings, is to parrot back what others are saying as confirmation you've understood what they have said (p.368). This is similar to an approach mentioned in Jordan Peterson's \"12 Rules of Life\", where you need to accurately summarise a person's ideas as you understand them, before conveying your own points.\r\n\r\n3. Here is a list of authors and books mentioned as having been read by the biographee:\r\n\r\n```\r\nAuthors:\r\n* Martin Heideggar\r\n* Friedrich Nietzsche\r\n* Arthur Schopenhauer\r\n\r\nBooks:\r\n* Douglas Adams\r\n  │── \"Hitchhiker's Guide to the Galaxy\" (1979, sci-fi)\r\n* Isaac Asmiov\r\n  │── \"Robots and Empire\" (1985, sci-fi)\r\n  │── \"Foundation\" series (1951-1993, sci-fi)\r\n* Iain Banks\r\n  │── \"Culture\" series (1987-2012, sci-fi)\r\n* Clayton Christensen\r\n  │── \"The Innovator's Dilemma\" (1997, business)\r\n* Winston Churchill\r\n  │── \"The Second World War\" (1948-1953, history)\r\n* Robert Heinlein\r\n  │── \"The Moon Is a Harsh Mistress\" (1966, sci-fi)\r\n* The Onion\r\n  │── \"Our Dumb Century\" (1999, satire)\r\n\r\nMagazines:\r\n* Amazing Stories magazine (1926-1939, sci-fi)\r\n```\r\n\r\n\r\n\r\nThis book is an excellent testament to how belief in humanity, curiosity, intelligence, sheer force of will, luck, and karma can overcome near-impossible odds and make an at-scale tangible difference. It also shows the depth of sacrifice and toll it takes to pursue such a path.\r\n\r\nThe biographee envisions humanity being more technologically advanced than now to achieve species-level self-determination in the universe. His success in making tangible steps toward this explains why his efforts are often widely acclaimed.\r\n\r\nAfter reading it, this book may provoke your surrendered existential nihilism, an existential crisis of self-comparison, or inspiration for positive change--so choose wisely. Personally, I'll opt for the more hopeful outlook.\r\n\r\n\r\n\r\n### Reference\r\n\r\n* **[Elon Musk by Walter Isaacson (2023)](https://www.simonandschuster.com.au/books/Elon-Musk/Walter-Isaacson/9781761427978)**\r\n\r\n\r\n\r\nClick **[here](https://github.com/makuharistudio/makuharistudio.github.io/blob/main/src/markdown/readings/2025-04-20.md)** for this reading page's markdown file in GitHub."
  },
  {
    "id": 1742043600,
    "title": "12 Rules for Life\r",
    "name": "12-rules-for-life",
    "author": "Jordan B. Peterson\r",
    "publisher": "Penguin Random House UK\r",
    "publisherURL": "https://www.penguin.co.uk/books/309610/12-rules-for-life-by-peterson-jordan-b/9780141988511\r",
    "photo": "../assets/readings/12-rules-for-life-by-jordan-b-peterson.png\r",
    "category": "personal development\r",
    "date": "16 March 2025\r",
    "desc": "A philosophical guide on foundational approaches to help live a better life supported with anecdotes from the author's personal life and clinical practice, science, religion, and fiction.\r",
    "tags": "[\"Personal development\", \"Philosophy\"]\r",
    "content": "![12 Rules for Life by Jordan B. Peterson](/src/assets/readings/12-rules-for-life-by-jordan-b-peterson.png)\r\n\r\n\r\n\r\nThis book was name-dropped in the author's YouTube lectures and interviews, so I bought a copy to try it. It is the first non-technical book I read since university, so it was not an easy transition to go from my preferred reading of factual and \"to-the-point\" near-discussionless information, to wading through such philosophical and life-orientated lessons.\r\n\r\nAdmittedly, I nearly dropped the book early on where it discussed the difference between light and darkness, as I felt it lingered too much on that point. I powered through that and was rewarded with interesting anecdotes from the author's life and clinical practice. Being careful not to spoil, the most memorable example for me is when the author and his wife looked after a neighbour's neglected child.\r\n\r\nA part of me wished I had the knowledge in this book at an earlier age in life, but I do wonder if youthful impatience would have prevented me from properly incorporating those lessons.\r\n\r\nThese rules (or variations of them) I had already been aware of and tried living by before finding this book:\r\n\r\n* Rule 1: Have good posture.\r\n* Rule 4: Don't compare yourself to others. \r\n* Rule 6: Fix yourself instead of blaming others.\r\n* Rule 7: Choose the actions that will improve your tomorrow instead of indulging in today's pleasure.\r\n* Rule 8: Avoid lying.\r\n* Rule 9: You don't know everything so try genuinely listening to others.\r\n* Rule 11: Let yourself and others test their limits and be challenged.\r\n* Rule 12: Enjoy the few miraculous and wonderous moments that life gives you.\r\n\r\nThese were the lessons that were new for me:\r\n\r\n* Rule 2: Build the attitude to want to help yourself get a better life, regardless of any self-contempt or self-criticisms you have.\r\n* Rule 3: Surround yourself with people who genuinely strive for their own self-improvement, and expect for your relationships with them to not be easy. It is better than having a supposedly effortless relationship with someone who sees your self-improvement efforts as a fault.\r\n* Rule 5: Discourage behaviours in the people close to you which may lead them to becoming a social disgrace or being mentally immature.\r\n* Rule 10: Communicate your feelings to confront those feelings and what you intend. Even when your efforts to be precise don't solve the problem, at least you will remove the ambiguity which is far worse than the problem.\r\n\r\nBasically, the book encourages you to improve your internal locus of control, by setting your mindset and life in a constructive direction. One recurring way it does this is by confronting people so corrupted by their own nihilism, that they denounce humanity whilst hiding behind a false guise of being anti-prejudice.\r\n\r\nMy favourite quote:\r\n\r\n\"Aim up. Pay attention. Fix what you can fix. Don't be arrogant in your knowledge. Strive for humility, because totalitarian pride manifests itself in intolerance, oppression, torture and death. Become aware of your own insufficiency--your cowardice, malevolence, resentment and hatred. Consider the murderousness of your own spirit before you dare accuse others, and before you attempt to repair the fabric of the world.\" (p.198)\r\n\r\nThe book has a number of other wisdoms, but I'll list only 3 of my other favourites below. The rest you can read the book to discover.\r\n\r\n1. You need to reveal yourself to the world for the best possible version of you to be brought forth into the world (p.212).\r\n2. Make your ambitions based on the building of your character and ability because those will always be with you regardless of status and power which can easily be lost (p.224).\r\n3. Deliberately say the things and go to the places that put you into the new situations needed for you to be switched on and placed on the path to be more complete as an individual (p.212).\r\n\r\nIn summary, the book may be a difficult read for the philosophically uninitiated, but the lessons are good. Truthfully, I prefer to listen to the author's lectures and interviews. They have less content, but there's more conciseness, logical reasoning, and stronger engagement in video format.\r\n\r\n\r\n\r\n### Reference\r\n\r\n* **[12 Rules for Life by Jordan B. Peterson (2018)](https://www.penguin.co.uk/books/309610/12-rules-for-life-by-peterson-jordan-b/9780141988511)**\r\n\r\n\r\n\r\nClick **[here](https://github.com/makuharistudio/makuharistudio.github.io/blob/main/src/markdown/readings/2025-03-16.md)** for this reading page's markdown file in GitHub."
  }
]