[
  {
    "id": 1749996000,
    "title": "Mastery\r",
    "name": "mastery",
    "author": "Robert Greene\r",
    "publisher": "Profie Books\r",
    "publisherURL": "https://profilebooks.com/work/mastery\r",
    "photo": "../assets/readings/mastery-by-robert-greene.png\r",
    "category": "personal development\r",
    "date": "16 June 2025\r",
    "desc": "An exploration into how to determine your Life's Task and strategies to accomplishing it with anecdotes of the journeys of key historical masters.\r",
    "tags": "[\"Personal development\", \"Business\"]\r",
    "content": "![Mastery by Robert Greene](/src/assets/readings/mastery-by-robert-greene.png)\r\n\r\n\r\nThis book covers the author's strategies on finding your Life's Task and navigating the phases to achieve mastery for that task.\r\n\r\nThe blog post below is my effort to extract the practical elements from the book's principles for my own reminder and ease of personal application. Though it was not until some time into writing it that I found the \"Concise\" versions of the author's books render my effort essentially moot, but I continued to finish this post.\r\n\r\nI realised this when I was buying my next book, \"The Concise 33 Strategies of War\", and compared it to its non-concise version. Essentially, the author's standard books are what you want to read because they include more anecdotes, whereas the Concise ones are what you need as a portable guide.\r\n\r\nI highly recommend this book. So much so I feel like it should be mandatory highschool reading. Or at least its principles be taught earlier on in a person's life.\r\n\r\n\r\n\r\n## Finding your life's task\r\n\r\n\"Life's Task\": the innate force of purpose which uniquely drives you and it may feel lost because you succumbed to counterforces like social conformity. Push past those counterforces and find it (p.26-28).\r\n\r\n5 strategies to combat counterforces:\r\n\r\n1. **Do NOT let the voices of others infect you**: Find something you are primally attracted to that's not infected by anyone else's desires by looking for signs that point to your origin's core (p.31-32).\r\n\r\n2. **Avoid fighting over limited resources**: The career world's politics and competition can wear you down. So start in a field that approximately your interests then:\r\n   - a. look for attractive side paths and stay on them until you find a niche, or\r\n   - b. master that first field, then combine it with others to make a unique one you own (p.35-36).\r\n\r\n3. **Avoid choosing false paths**:  Accept you chose your current career for wrong reasons (money, fame, attention, etc.). Fight the counterforces and establish your own identity (p.37-38).\r\n\r\n4. **Do not get stuck in the past**: Your loyalty should be to your Life's Task, rather than to a career or company. Adapt your Life's Task to your changing situation by letting go of past ways of doing things to avoid falling behind (p.40).\r\n\r\n5. **Avoid losing your way**: Listen to your deep frustrations about your incorrect deviation from your Life's Task and let them guide you back onto the right path (p.42-43).\r\n\r\nIn summary, resist the temptation to be like others. Apply yourself to the small things you are good at to build a foundation whilst learning diligence, discipline, and focus. Extraordinary people are clearly loyal to their calling. Define your Life's Task to set yourself onto the path of its mastery (p.45-46).\r\n\r\nThere are 3 phases toward mastery\r\n* **Apprenticeship**: Learning basic elements and rules of the field.\r\n* **Creative-Active**: Through practice and immersion, you have a comprehensive understanding of the field and are now able to experiment and play.\r\n* **Mastery**: Deep knowledge, experience, and focus lets you see the complete picture and giving you greater command over the real world (p.3).\r\n\r\n\r\n\r\n## APPRENTICESHIP PHASE\r\n\r\nOnly focus on transforming your mind and character. Be grounded in objective reality by learning to work with others, be disciplined, and handle criticism. Choose workplaces and positions with the most learning of practical knowledge with challenges to toughen and improve you (p.55).\r\n\r\nThis phase has 3 modes of being and strategies to navigate them:\r\n\r\n1. **Deep observation / passive mode**: Set aside your needs, desires, ego, and preconceptions. Observe the reality of your environment by submitting to it and show your desire to learn. Pay attention to unstated rules and communication flow (p.56-58).\r\n\r\n2. **Skills acquisition / practice mode**: Train your hands-on knowledge by aiming for the \"cycle of accelerated returns\" whereby practice becomes easier and enthusiasm makes you go for longer.\r\n  \r\n   To reach this cycle:\r\n   - Start mastering only one skill so you can also learn to concentrate.\r\n   - Embrace the tedium of practice because it embeds the skill so you can do it subconsciously.\r\n   - Once your skill is automatic, observe yourself practicing and correct your flaws (p.59-60).\r\n\r\n3. **Experimentation / active mode**: Take on more responsibility, exposing yourself to peer or public criticism and take it constructively. When you feel there is nothing left to learn, the apprenticeship phase is over (p.63).\r\n\r\n### 8 Strategies to complete the ideal apprenticeship\r\n\r\n1. Value learning over money\r\n   - Find a place with people and mentors who can inspire and teach you (p.67).\r\n\r\n2. Keep expanding your horizons\r\n   - Keep moving, otherwise the world closes in on you due to your self-confinement.\r\n   - Mingle with many types of people, forcing yourself to look for new challenges (p.68-71).\r\n\r\n3. Revert to a feeling of inferiority\r\n   - Avoid having a sense of superiority and closed-mindedness about your existing knowledge.\r\n   - Foster your child-like sense of wonder and curiosity by participating as deeply as possible until you've learned to be independent (p.73-74).\r\n\r\n4. Trust the process\r\n   - Do not give up. Take your time learning so you can internalise it.\r\n   - The only real hinders to your progress are your feelings of boredom, panic, frustration, and insecurity (p.77).\r\n\r\n5. Move towards resistance and pain\r\n   - Fight off the tendency to shrirk away from difficult things.\r\n   - Do more than the conventional practice others have done.\r\n   - **\"Resistance Practice\"**:\r\n      - Do not be kind to yourself during practice.\r\n      - Be your own worst critic by recognising and prioritising your weaknesses, then invent exercises to address them.\r\n      - Keep concentrating even if it means doubling the intensity.\r\n      - Give yourself arbitrary deadlines and standards, and push yourself past your perceived limits (p.80-81).\r\n\r\n6. Apprentice yourself in failure\r\n   - There are 2 types of failure:\r\n     - Never trying an idea out of fear or waiting for right time; timidity is self-destructive.\r\n     - Having a bold and adventurous spirit; failings become learnings that outweigh any reputational hit.\r\n   - Repeated failure toughens you and shows what needs to be done (p.84).\r\n\r\n7. Combine the \"how\" and the \"what\"\r\n   - Don't just focus on visual design. Grasp how something works by studying its technology, as there is beauty in functional essence (p.87).\r\n\r\n8. Advance through trial and error\r\n   - This is a satisfying, non-rigid, and patched-together path to improvement.\r\n   - Learn many skills in the direction that circumstances lead, but only if they relate to your deepest interests.\r\n   - In your 20s, wander around to expand your skill base and possibilities.\r\n   - Avoid following one career path, as that gets you in a career dead-end by your 40s (p.87-90).\r\n\r\n\r\n\r\n## Mentor Dynamic\r\n\r\nMentors have the experience to tailor their lessons to your circumstances, whereas books and such do not, making mentor's lessons more efficient and internalised (p.103).\r\n\r\nA good mentor encourages your separation from them once you've learned all you need and remains a lifelong ally. You needn't feel any guilt when leaving as your objective was independence via learning from them (p.100 & 107).\r\n\r\n### 4 strategies to deepen the dynamic with your mentor\r\n\r\n1. Choose your mentor based on your needs, inclinations, Life's Task, and future envisionment of yourself\r\n   - Look for one who would give you the support, confidence, direction, and space to discover things on your own.\r\n   - Be conscious of their methods or styles that rub you the wrong way as they may be a sign to move on.\r\n   - Move on once you learned everything you want and begin the search again (p.109-112).\r\n\r\n2. Gaze deep into your mentor's mirror\r\n   - Your mentor must give you sharp doses of reality, and as an apprentice you must build from the feedback (p.115-116).\r\n\r\n3. Transfigure your mentor's ideas\r\n   - Adapt your mentor's ideas to your own circumstances to address the sense of identity loss from being taught (p.119).\r\n\r\n4. Create a back-and-forth dynamic\r\n   - Both need to keep the dynamic animated so the apprentice can learn as much as they can.\r\n   - Improves on your mentor's teachings and discusses these with them (p.121).\r\n\r\nThe author cites Leonardo da Vinci: \"Poor is the apprentice who does not surpass his Master\" (p.119).\r\n\r\n\r\n\r\n## Social intelligence\r\n\r\nDo not be naive. Be socially intelligent. This is characterised by accepting the futility of changing another person's fundamental traits and having tolerance to allow them to live as they are, and understand them enough to influence their behaviour (p.125, 130, 137).\r\n\r\n### Reading an individual's nature\r\n\r\nYou can induce how another person sees the world:\r\n- Pay less attention to their words.\r\n- Pay attention to their vocal tone, the look in their eyes, body language, and emotional signals for anxiety, resentment, and falseness.\r\n  - Observe their actions and decisions to derive motives.\r\n  - Extreme behaviours may be a mask e.g. them being overly friendly because they are secretly aggressive, or they tell jokes to hide their mean-spiritedness.\r\n- Refrain from judging people straight away, and let the passing months reveal more because people have a public persona for self-protection.\r\n- Understand that people are in a state of flux and you are just up-to-date tabs on them, so do not fixate on one image of them (p.139-140).\r\n\r\n### 7 realities of general human nature\r\n\r\nThese are 7 patterns of negative behaviour and strategies on how to find and address them.\r\n\r\n1. Envy\r\n   - Identifiers:\r\n     - People who praise you too much or are overly friendly on first meeting.\r\n     - People with unusual levels of insecurity.\r\n   - Strategy: Can only be countered by preventing it from being triggered.\r\n     - If you are strong in one area, demonstrate a weakness in another to humanise yourself.\r\n     - If the envious person is an insecure type, display interest in their work by turning to them for advice.\r\n     - Do not be boastful about success and instead ascribe it to good luck (p.141-142).\r\n\r\n2. Conformism\r\n   - Identifiers:\r\n     - People feel compelled to display opinions or ideas matching the group's standards.\r\n     - The group's overseers can be dangerous.\r\n   - Strategy: Do not display your difference from the group too overtly.\r\n     - Wear a mask for the workplace, and reserve your colourfulness for your friends.\r\n     - \"Be careful in what you say--it is not worth the bother of freely expressing your opinions\".\r\n     - If you do differ, do not give the group the material needed to attack you for some other reason (p.142).\r\n\r\n3. Rigidity\r\n   - Identifiers:\r\n     - People following procedures without knowing why.\r\n     - People get defensive when their methodologies are questioned, especially if logic disproves them.\r\n     - Group members get irritable or panicky at hints of change.\r\n   - Strategy: Accept the fact others are rigid.\r\n     - Outwardly display deference to their need for order, because championing change creates hidden enemies.\r\n     - Independently maintain your openness to change, let go of bad habits, and create new ideas (p.143).\r\n\r\n4. Self-obsessiveness\r\n   - Identifier:\r\n     - People justify their actions with morality or a saintly aura, but appeals to their assumed charitability results in decline because they have nothing to gain.\r\n   - Strategy:\r\n     - Make conversations revolve around them and their interests, and offer something concrete in return for their efforts (p.143-144).\r\n\r\n5. Laziness\r\n   - Identifiers:\r\n     - People steal your ideas.\r\n     - People want to collaborate but contribute less, with unfair expectation of equal rewards.\r\n   - Strategy: Be prudent and keep your ideas, or at least details to yourself.\r\n     - Be wary of people who want to collaborate.\r\n     - In some workplaces a superior takes full credit for your work with your name excluded, but don't let same-level colleagues get away with it (p.144).\r\n\r\n6. Flightiness\r\n   - Identifier:\r\n     - People whose ideas or feelings on matters change based on their mood.\r\n   - Strategy:\r\n     - Never assume what someone says is a permanent statement.\r\n     - Be detached to people's shifting emotions, and focus instead on their actions (p.144-145).\r\n\r\n7. Passive aggression (p.145)\r\n   - Identifiers:\r\n     - Person fears direct confrontation.\r\n     - Low-level behaviours include:\r\n       - Procrastinating on a project\r\n       - Showing up late\r\n       - Making off-handed offensive comments\r\n     - Full passive-aggressive attacks have an outwardly friendly exterior contrasting negative actions.\r\n     - \"Passive-aggressive warriors\" are so overflowing with insecurities that they'd be happy to ruin your life.\r\n   - Strategies:\r\n     - For low-level passive aggressives, if they are harmless then ignore them, otherwise call them out.\r\n     - For passive-aggressive warriors, learn to identify such people and avoid them like the plague, there'll be evidence of past skirmishes.\r\n     - For full passive-aggressive attacks there are 2 options:\r\n       - 1. Get out of their way, or\r\n       - 2. Return the attack with something equally indirect to signal they'll pay a price to continue. Only do this if you can be emotionally unentangled.\r\n\r\n### 4 strategies to acquire social intelligence\r\n\r\n1. Speak through your work by being efficient and detail-orientated in what you do (p.152).\r\n2. Craft the appropriate persona for the world and continuously adjust it ahead of problemsby not settling on a single image and avoid being completely figured out (p.155).\r\n3. See yourself as others see you, and correct your social flaws, especially ones with a pattern of worsening social dynamics (p.159).\r\n4. Suffer fools gladly by accepting you too have been one, such that you accept the foolishness in others or at least tolerate them, instead of trying to change them. If you lack the patience for this, then stay away from those situations (p.163-164).\r\n\r\n\r\n\r\n## CREATIVE-ACTIVE PHASE\r\n\r\nThe author outlines 3 states of mind we grow through:\r\n\r\n* **Original mind**: During childhood we thought preverbally in images and sensations with a receptiveness to new information.\r\n* **Conventional mind**: During adulthood we stop wondering about things as they and become defensive about the world we take for granted with a not-so engaged nor creative mind.\r\n* **Dimensional mind**: Masters blend the conventional mind's discipline with original mind's child-like creativity by creating rather than consuming (p.175-178). Awakening this mind involves 4 methods:\r\n\r\n### Method 1: Choosing the Creative Task to maximise your skills and knowledge\r\n\r\nYour creative task selection must be like your Life's Task selection, connecting something so deep within you that you are committed to solve it regardless of the years of failures it may involve. Your genuine excitement will reflect as greater details in your output (p.179-180).\r\n\r\n2 important notes:\r\n1. Your chosen task must be realistic, reasonable, and can be a little above this if you're ambitious. But your skills and knowledge must be suited to pull it off.\r\n2. Throw away your need for comfort and security, because creative ventures are inherently uncertain. Be an explorer who leaves the shore (p.181).\r\n\r\n### Method 2: 5 creative strategies to loosen the mind\r\n\r\nThe mind \"tightens\" over time from a preference for consistency and from the narrowing of viewpoints whilst being focused (p.181). Here are 5 strategies to counter this.\r\n\r\n1. Cultivate negative capability a.k.a. the ability to endure uncertainty by suspending your ego, opinions, judgment, and confirmation bias, and entertain a broad range of ideas and the unfamiliar (p.182-183).\r\n\r\n2. Allow for serendipity by opening up to other stimuli and other research fields, giving full attention to unexpected ideas and where they lead (p.184-185).\r\n\r\n3. Alternate your mind through your explanations of observations by speculating against your inherent scepticism, being willing to confirm or disconfirm your theories, and making tangible objects of them e.g. prototypes (p.189-190).\r\n\r\n4. Alter your perspective and subvert your conventional mind by looking at problems holistically and at different angles, paying attention to anomalies without letting paradigms explain them away, and looking for what is absent as clue for unmet needs (p.191-193).\r\n\r\n5. Revert to primordial forms of intelligence by thinking with your senses which can take the form of visualisation, diagrams, models, scents, and rubber ball squeezing (p.197-198)?\r\n\r\n###  Method 3: Creative breakthrough -- tension and insight\r\n\r\nYou will reach a breaking point where you lose your initial energy. Accept this as a natural part of the process, and an indicator to distance yourself temporarily, which may give you the chance to reinvigorate. One approach is by manufacturing deadlines (p.199-201).\r\n\r\nHere are 6 emotional pitfalls to avoid during the creative-active phase and how to address them:\r\n1. Complacency: Constantly remind yourself how little you know to uphold your value of wonder.\r\n2. Conservatism: Make creativity your goal, not comfort.\r\n3. Dependency: Develop high internal standards and independence to find yourself without the opinion of others.\r\n4. Impatience: Build an enjoyment for rigorous practice to go past your limits and apply yourself with the same vigour across projects.\r\n5. Grandiosity: Build an attitude that regards public attention as a distraction and focus on the work and process itself.\r\n6. Inflexibility: Avoid emotional extremes by feeling optimism and doubt at the same time, and be able to bend to the moment (p.202-204).\r\n\r\n###  Method 4: 9 strategies for creative-active phase\r\n1. Develop an authentic voice by being patient and mastering the basics of your intended skill (p.209).\r\n2. Be opportunistic and open minded to search for an empirical fact that does not fit the paradigm and is of great yield and let it lead you, rather than beginning with a problem to solve or goal to pursue with trivial implications (p.214).\r\n3. Mechanical intelligence can be a source of creativity by testing and using your own design or experiencing the product as a whole (p.219).\r\n4. Natural powers of the brain can be leveraged by having a loose start in the creative process, having a wide knowledge in other fields, constantly improve your ideas through an ongoing sense of dissatisfaction, and enjoying the overall creative process regardless of time (p.223-224).\r\n5. Look inward to express your unique inner self that's not sparked by a trend, consciously going against dead conventions, and create space to plant your new thing in our cluttered culture (p.228-229).\r\n6. Understand the big picture and purpose, and avoid perceiving problems based on your technical knowledge to broaden your investigation paths (p.231).\r\n7. Let accidents and contingencies play a role in the creative process, like finding other ways to use things (p.235-236).\r\n8. Take a holistic approach by looking at things from many angles and dimensions to help unravel the truth (p.242).\r\n9. Move beyond a duality perception by examining contradictions and going to a level past those opposites (p.245).\r\n\r\nTo make a discovery or creative work first requires great discipline, self-control, and emotional stability to master your field (p.245-246).\r\n\r\n\r\n\r\n## MASTERY PHASE\r\n\r\nMastery is \"...a sensation of suddenly possessing heightened intellectual powers after years of immersion in their field\", experienced as intuiting or feeling more with high-level intuition of the whole being the ultimate sign of mastery (p.256-258). It allows you to \"...maintain a sense of destiny, and feel continuously connected to it\" (p.261).\r\n\r\n### Keys to mastery\r\n\r\n1. Roots of mastery intuition\r\n\r\n\"Primitive\" or \"high-level\" intuition is driven by memory, and keeping it in memory requires repetition, intensity of experience, and paying attention. In time-critical endeavours, a master's intuited decisions are more effective than attempts to analyse all information. However, we live in an age where technology does that remembering for us, making our brains flabby from the decreased use. To counter this, take up hobbies that are fun and strengthen your brain's memory capacity (p.263-265).\r\n\r\n2. Return to reality\r\n\r\nThe ultimate reality is that all life is interrelated with every event being a consequence of another. As specialists connect their disciplines to those of others, it is in a way creating the connections that return us to reality. We can participate in this trend of creating connections by pursuing mastery (p.267-268).\r\n\r\n\"The brain of a Master is so richly interconnected that it comes to resemble the physical world, and becomes a vibrant ecosystem in which all forms of thinking associate and connect\" (p.269).\r\n\r\n### Strategies to attain mastery\r\n\r\nMasters know that trying to fit into a conventional mould dampens their spirit because the reality they seek eludes them. So they forge their own route, one others will see as unconventional. This requires an X factor necessary for attaining mastery (p.269).\r\n\r\nHere are 7 examples of this X factor.\r\n\r\n1. Connect to your environment - Primal Powers\r\n\r\n   Achieve this by observing it and consider everything in it as a potential sign, constructing a system that has a sense for changes before they happen. We are in an era where we mustn't be distracted by technology, remember that technology is the means not the ends lest your brain atrophies (p.273).\r\n\r\n2. Play to your strengths - Supreme focus\r\n\r\n   Figure out your mental and psychological strengths, and work with them to find a path to mastery that suits you and brings you joy and unburdened by conventions that go against your nature, for example, Einstein's strongest qualities were not his knowledge of mathematics and physics, but his patience and tenacity (p.279).\r\n\r\n3. Transform yourself through practice - The fingertip feel\r\n\r\n   When you practice a skill long enough, the skill becomes automatic, with the sensation that the mind and body are operating together as one in a way that resembles animal instincts and it is the nature of the brain to be trained through repetition (p.288-289).\r\n\r\n4. Internalise the details - The life force\r\n\r\n   Love immersing yourself in the details for its own sake, and detest having to skip them. People these days are too much in a hurry to create a splash that they skimp on the details, so their efforts doesn't connect deeply with the public. Your creations need a life of their own, not momentary attention (p.293).\r\n\r\n5. Widen your vision - the global perspective\r\n\r\n   In competitive environments, a wider and more global perspective prevails because it goes beyond the moment to control the overall dynamic via strategy, whilst most people are locked in the present. You can increase your outlook by constantly reminding yourself of the purpose and your long-term goals (p.297).\r\n\r\n6. Submit to the other - the inside-out perspective\r\n\r\n   We have a prejudice to observe things from the outside to preserve our objectivity, but that may lead to incorrect assumptions. We never truly understand what other people experience, unless we continually expose ourselves to them to try to think from their perspective and without imposing our own values on them (p.303).\r\n\r\n7. Synthesize all forms of knowledge - The universal man/woman\r\n\r\n   One type of mastery is the ability connect different subjects, which is regarded as a universalising process. The human brain desires to create connections and this is what gives it its own will (p.309).\r\n\r\n\r\nFailing to pursue mastery or deny its existence leads to feelings of powerlessness, disappointment, and enslavement to a false version of yourself which was constructed from other people trying to make you conform to their ideas, including your own self-deception that such mastery is only for geniuses. Do not waste your uniqueness. Find the most fundamental and natural inclinations you have, and express them as you pursue mastery (p.309-310).\r\n\r\n\r\n\r\n## Reflection\r\n\r\nThis book feels like a sign post for those of us in the 99% of humanity who give up on ourselves, and shows how people who started off at the same or worse baselines than us, were able to craft themselves into masters.\r\n\r\nThe principles in it are timeless, and really should be mandatory reading for high schoolers.\r\n\r\nAs a self development book, this one felt more goal orientated compared to the \"12 Rules For Life\" by Jordan Peterson which felt more for daily living. Though I prefer this book more for its ease of reading and its mission-based intent.\r\n\r\nLike most when I was young, I was fed the preconceptions of having to get into university and then get a job, with no questioning of why we had to do things that way. I feel it is better and more honest to say upfront that life is not a fixed path you have to follow, that opportunities are all around you no matter the age, and you need to seize them. That point is what makes this book work tremendously well.\r\n\r\nYou only have one life, and all the circumstances leading up to your existence were highly improbable, so use it for the core of who you are.\r\n\r\nIn terms of the anecdotes, my favourites included:\r\n\r\n* Leonardo da Vinci's study into single piece moulding of a bronze statue (p.24), which was reminiscent of Elon Musk's idea for Tesla's chassis to be made of a single piece based on a toy car.\r\n\r\n* Cesar Rodriguez who trusted the process of training and pushing himself, going from a benched panicked pilot, to becoming nicknamed the \"Last American Ace\" fighter pilot (p.77)\r\n\r\n* William Harvey's approach of thoroughly experimenting his hypothesis before trying to push it onto others\r\n  - He wisely confided his discoveries to the King early on to gain his trust and support.\r\n  - Behaved humbly and with self-deprecation\r\n  - Played the role of court diplomat and avoided aligning with any faction nor got involved in intrigue (p.150).\r\n\r\nThe book has a number of other wisdoms, but I'll list only a few of my favourites below. You can read the book to discover more.\r\n\r\n* Following the lead of others or a book's advice is self-defeating (p.55). A little ironic here.\r\n\r\n* \"In the future, the great division will be between ... those who can acquire skills and discipline their minds and those who are irrevocably distracted by all the media around them and can never focus enough to learn\" (p.64).\r\n\r\n* \"The very desire to find shortcuts makes you eminently unsuited for any kind of mastery\" (p.90).\r\n\r\n* \"The problem with all students, ...is that they inevitably stop somewhere. They hear an idea and hold on to it until it becomes dead; they want to flatter themselves that they know the truth. But true Zen never stops, never congeals into such truths. That is why everyone must constantly be pushed to the abyss, starting over and feeling their utter worthlessness as a student. Without suffering and doubts, the mind will come to rest on cliches and stay there, until the spirit dies as well...You must continually start over and challenge yourself\" (p.115). \r\n\r\n\r\n\r\n### Reference\r\n\r\n* **[Mastery by Robert Greene (2012)](https://profilebooks.com/work/mastery)**\r\n\r\n\r\n\r\nClick **[here](https://github.com/makuharistudio/makuharistudio.github.io/blob/main/src/markdown/readings/205-03-16.md)** for this reading page's markdown file in GitHub."
  },
  {
    "id": 1745071200,
    "title": "Elon Musk\r",
    "name": "elon-musk",
    "author": "Walter Isaacson\r",
    "publisher": "Simon & Schuster\r",
    "publisherURL": "https://www.simonandschuster.com.au/books/Elon-Musk/Walter-Isaacson/9781761427978\r",
    "photo": "../assets/readings/elon-musk-by-walter-isaacson.png\r",
    "category": "biography\r",
    "date": "20 April 2025\r",
    "desc": "A chronicle of Elon Musk's journey from a difficult childhood to his successive founding of multiple industry-redefining companies up until the early establishing of X.AI in 2023.\r",
    "tags": "[\"Biography\", \"Technology\", \"Business\"]\r",
    "content": "![Elon Musk by Walter Isaacson](/src/assets/readings/elon-musk-by-walter-isaacson.png)\r\n\r\n\r\n\r\nThis book chronicles the biographee's life from a challenging childhood to the founding of multiple companies that revolutionised key technology industries.\r\n\r\nThis is the first biography I ever read, and it was difficult because I found the idea of biographies to be uncomfortably intrusive. However, my curiosity to understand how someone who has achieved so much in a single lifetime in multiple highly intellectual fields can possibly exist won me over.\r\n\r\nBefore reading this book, my initial knowledge on the biographee was very superficial as I had only seen a few interview clips on YouTube. After reading this book, I better appreciate how ridiculously rare he is as an individual, and can see why some conspiracy theorists and Internet meme creators may equate this rarity to him being an extraterrestrial. I am happy to have that superstitious veil lifted and to see the extreme effort and sacrifices needed to create a paragon of human endeavour.\r\n\r\nThe biographee been through many misfortunes that may otherwise be enough to cause other people to give into darker life paths. So to remain on his path in building the at-scale foundations for a better future despite these tribulations is amazing and proof he's living a full life:\r\n\r\n- Born into a country where daily fatal violence in public areas is the norm.\r\n- Physically bullied to near death as a child.\r\n- Impacted by a challenging relationship with a now estranged father since childhood.\r\n- Divorced mother who worked multiple jobs to make ends meet.\r\n- Unable to make friends until he started university.\r\n- Passing away of his first-born infant son.\r\n- His political enemies manipulating one of his other children, causing estrangement between them.\r\n- Romantic breakup leading to severe depression and impacting work performance.\r\n- An ongoing neck injury.\r\n- A seemingly chaotic-good alignment that constantly desires being in intense situations.\r\n\r\nThe problem with reviewing biographies is the misplaced tendency to judge the biographee as a person, rather than the biography as a book.\r\n\r\nSo, to get straight to it, the book is an engaging mix of dramatic, heartfelt, and humorous anecdotes. Whilst the author occasionally expresses misgivings like describing the biographee's ability to present his vision \"as a mandate from heaven\" (p.94), the overall narrative feels balanced because despite tensions, the author remains committed to presenting an honest account, allowing readers to interpret the contradictions for themselves.\r\n\r\nI've decided to encapsulate some of the business-related lessons from the book in areas like leadership, team dynamics, communication, etc. for ease of personal reference. This book has a multitude of other lessons in morality, integrity, relationships, politics, and more, but those and the anecdotes won't be covered here. Please refer to the book for that information.\r\n\r\n\r\n\r\n## PERSONAL MINDSET\r\n\r\n### Define who you are\r\nFind the thing you want to do which will have the most impact because pursuing that may be the best way to spend your life, rather than on something else you may enjoy doing or are good at but has low impact (p.56). Once you've identified that, then identify if you are okay working for other people to pursue it, or if you prefer having people work for you, so you can commit to that preference earlier on in life (p.48).\r\n\r\n### Learn by risk-taking\r\nDo not base your decisions out of fear of something, instead use the risk as your fuel to push yourself forward (p.25, 252). Even when your risk-taking fails, do your best to make every bad situation salvageable (p.116). When your risk-taking succeeds, don't waste the wealth earned from it into short-term pleasures that achieve nothing, invest it back into the game of life and play again (p.67).\r\n\r\n### Use objective and iterative problem-solving\r\nKnow when to step back from your emotions and to reframe a problem (p.99 & 247). Take an iterative approach and learn by failing with the attitude of quickly getting back up to identify each successive problem so you can fix them (p.114). Have the humility to accept being wrong, just don't be confidently wrong (p.286).\r\n\r\n###\t\"Polytopia life lessons\"\r\nPolytopia is a video game that the biographee recommended to his brother on learning how to be a CEO, and these are key lessons from the game (p.426-427)\r\n1.\tEmpathy is a liability in business.\r\n2.\t\"Play life like a game\".\r\n3.\tLosing is inevitable and will happen many times. Get used to it so you become fearless and take more risks.\r\n4.\tBe proactive and take charge of setting the strategy.\r\n5.\tOptimise every turn you have in life, and let nothing slide.\r\n6.\tPut everything back into the game to grow.\r\n7.\tPick your battles carefully by using front minimisation tactics.\r\n8.\tUnplug at times by removing distractions.\r\n\r\n\r\n\r\n## STRATEGY AND VISION\r\n\r\n### Define a broad business mission\r\nWhen your company mission is important enough, optimism and pessimism are irrelevant. All that matters is taking the steps forward to achieve the mission, then work backward to figure out how to make it work financially (p.177 & 93). Make the mission broad like an innovation company, which is also advantageous in that any future acquisitions or mergers will be less challenged for being in line with the core innovation mission (p.254-257).\r\n\r\n### Find entrepreneurial opportunities\r\nDo not let incumbent industry mindset inhibit you from seeing opportunities in that industry (p.48). For example, figure out the reasons why that industry isn't doing well, and simplify the process for the customer by taking on the legwork to fix those problems (p.252). Be open to other business models to side-fund your main model, like selling a component your supply chain makes to another business, tying different endeavours together into a new one, or using data collected for a new purpose (p.193, 243-244).\r\n\r\n### Build a company attitude of anti-complacency\r\nA \"maniacal sense of urgency\" is needed as an operating principle for companies to avoid being flabby and slow because complacency can be a scourge to business (p.286, 349, 508). If your company is already too conservative and long-lived, quickly accept that you need to change, and adopt entrepreneurial efforts (p.222).\r\n\r\n### Be a product company, not a sales nor a platform company\r\nA platform company is merely an unbranded vendor for incumbent industry leaders (p.63-65), and a sales company neglects the philosophy that you should make a great product then let the sales follow up by themselves after that (p.253). So, it is important to be product-first. For high-cost industries, you can create a high-price and quality iteration before designing a mass-market model (p.127). You can also more easily gain public awareness by displaying prototypes to the public (p.121, 194).\r\n\r\n\r\n\r\n## LEADERSHIP\r\n\r\n### Lead by example, not by empathy\r\nAn effective leader is like a general on a battlefield, they need hands-on experience on the factory floor and be willing to do what they asked of the workers, otherwise they shouldn't ask the workers to do those things in the first place (p.285-286, 480). They have the openness to take in the risk information and data from their team, the flexibility to have their mind changed by the evidence, the decisiveness to make quick assessments and shift responsibility from the team to themselves, and the resolve to take ownership for their mistakes even if it needs to be done publicly (p.210, 282, 407). It is not the leader's job to make people love them, as that just leads to counterproductivity (p.64).\r\n\r\n### Communicate with workers rather than executives\r\nSpend your time on the shop floor listening to the suggestions of floor workers to find problems to solve and get information regarding limits your company can go beyond, one way to implement this is by performing skip-level meetings so workers can bypass direct supervisors and have their ideas heard (p.157, 286, 328). Be willing to treat people politely and respectfully, as not treating them well may make them disinclined to tell you where the problems are (p.166).\r\n\r\n### Draw clear lines for segregation of duties\r\nBe clear to employees that duties precede relationships. For example, if you are trying to drive down costs, ensure your financial analysts understand they are not to befriend the engineers who set the costs, because the analysts need to serve as objective judges of the engineers (p.363). Enforce internal transparency and integrity by proactively asking and investigating staff so that you can find conflicts of interest that are being hidden because there is no incentive for those conflicts which threaten your operations to out themselves (p.571).\r\n\r\n### Proactively fight against analysis paralysis\r\nLeaders need to step in when analysis paralysis is happening, to make decisions that will move efforts forward fast by trying, failing, then fixing, instead of spending months on analysis prior to taking action (p.388).\r\n\r\n\r\n\r\n## TEAM DYNAMICS\r\n\r\n### Hire team members based on attitude over skills and experience\r\n\"When hiring, look for people with the right attitude. Skills can be taught. Attitude changes require a brain transplant\" (p.286). Prioritise candidates who have an attitude to work maniacally hard, but be wary of anyone whose confidence is greater than their competence (p.350, 512). If you want to have a hardcore, fanatic work culture, you need to have a staffing method that cuts to the bone (p.522).\r\n\r\n### Encourage team members to prioritise their feedback loops over comradery\r\nIt is inevitable that employees will need a good feedback loop and have the initiative to seek criticism from others to improve (p.365). Comradery can be dangerous because it makes it hard for people to challenge each other's work, creating a counterproductive tendency to avoid throwing colleagues under the bus, but that tendency needs to be avoided for improvement to begin (p.285).\r\n\r\n### Prepare the team to support a leader who is steering off the rails\r\nNo one is perfect, and even a leader can make severely bad decisions out of impulsive emotion. To handle this, have a team member inform them as such and have other team members raise it with them to show consensus. Then ensure the team quietly knows to avoid carrying out reactionary orders from that leader until the storm of emotion passes and when that leader is able to properly process the inputs (p.539).\r\n\r\n\r\n\r\n## PRODUCT DEVELOPMENT\r\n\r\n### Innovate by setting metrics as your goal post\r\nInnovative business ideas come from translating the inefficiencies of existing technologies as clear metrics, like the time take to manually type information into a computer or the cost per pound to get a payload into orbit, then working hard to improve that metric's value by advancing its underlying technology (p.93, 355, 399). The metric's value can be displayed on a large monitor, so the team can treat it like a game to try to improve it, making it also a measure for product engineering performance (p.596).\r\n\r\n### Initial product brainstorming\r\nFirst think of the materials used to build your product including the reasonings for those materials and the product's structure, then have the team members create a detailed chart of any functionality they want and the cost of manufacturing each at scale (p.316, 486).\r\n\r\n### Co-locate engineers with designers\r\nHave designers and engineers work together in the same room so they can have a \"throw-it-over-the-fence\" mentality such they think like the other, because true industrial design connects the beauty of a product to its engineering (p.79, 137, 200). Separating product design from engineering is a recipe for dysfunction, so ensure you have set things up such that designers feel immediate pain if something they devised is hard to engineer. For this reason, engineers should lead the design process rather than product managers (p.79).\r\n\r\n\r\n\r\n## MANUFACTURING\r\n\r\n### Empower assembly line teams using factory layout\r\nWhen designing a factory, make the layout so that an assembly line person can collar a designer or engineer and hold them accountable to bad designs (p.109). This can be achieved by placing the cubicles for the engineers beside the assembly lines, so they can see when something goes wrong and hear complaints if their design causes a slowdown (p.219). Make it a collective responsibility by corralling the engineers to frequently walk up and the down the assembly lines with you to assess the production line's efficiency, so if they find an aspect of product design is expensive to produce, it'll require changing the design (p.219, 390).\r\n\r\n### Inhouse your supply chain and minimise dependencies\r\nAlthough outsourcing may be cheaper, a poor international supply chain can be a logistical nightmare and can cause cash-flow problems (p.160). Key components should be made inhouse to control quality, costs, and supply chain, whilst aiming for vertical integration (p.132). In-housing can be further improved by pursuing good manufacturing process inspirations, like the cold casting mould method used for toy cars which removes the need to piece together hundreds of parts (p.338). You can also cleverly get 24 hours of production with 16 hours of human labour using machines and careful prediction of when human intervention would be necessary, which helps get around labour laws whilst maximising production time (p.158-159).\r\n\r\n### Challenge costs\r\nChallenge your suppliers on costs they charge on components, especially if there are equivalent cheaper components in other industries, or consider making it in-house at a fraction of the price (p.112). \r\n\r\n### Pursue efficiency via the \"Idiot Index\" and \"The algorithm\"\r\nThe **idiot index** identifies the economically problematic components in the production process, and **the algorithm** is a methodology to improve the production process itself.\r\n\r\nThe **idiot index** is \"...the ratio of the total cost of a component to the cost of its raw materials. Something with a high idiot index--say a component that cost $1,000 when the aluminium that composed it only cost $100--was likely to have a design that was too complex or a manufacturing process that was too inefficient...If the ratio is high, you're an idiot\" for not addressing it (p.363).\r\n\r\n**\"The algorithm\"** is a 5-point checklist (p.284-285):\r\n1. \"Question every requirement. Each should come with the name of the person who made it. You should never accept that a requirement came from a department... Then you should question it, no matter how smart that person is...Then make the requirements less dumb\".\r\n2. \"Delete any part or process you can. You may have to add them back later. In fact, if you do not end up adding back at least 10% of them, then you didn't delete enough\".\r\n3. \"Simplify and optimize. This should come after step two. A common mistake is to simplify and optimize a part or a process that should not exist\".\r\n4. \"Accelerate cycle time. Every process can be [ sped ] up. But only do this after you have followed the first three steps\", it is a mistake to automate first because some time accelerating processes may need to be removed altogether.\r\n5. Automate. This comes last in designing the production process. Wait until all requirements have been questioned, and all unnecessary parts and processes deleted.\r\n\r\n\r\n\r\n## NEGOTIATION\r\n\r\n### Stay calm against disruptive opening offers\r\nDuring a business negotiation, if your counterpart is exaggerating numbers and making an offer that would be considered illogical, be patient and consider the possibility that it is just their opening move, before walking away from the table entirely. Some people just like to play games (p.77).\r\n\r\n### Convince with tangible actions, not with words alone\r\nIf you have a potential partner hesitant to join forces with yours, one strategy is to physically demonstrate at a very large scale, that your side is willing to plough ahead with your endeavour even without the potential partner, like the building of a for-purpose factory (p.221).\r\n\r\n### Do due diligence for acquisitions\r\nWhen making a deal to buy out a company, make it contingent on full due diligence to minimise the trouble it would otherwise cause later (p.463).\r\n\r\n### Pursue outcomes and merit-based work\r\nCost-plus contracts are where you are paid for your costs plus guaranteed profit, which is ineffective as it is an incentive to never finish work. If such a system is in place, challenge it with outcomes-based fixed pricing where companies should be risking their own capital (p.123). \r\n\r\n\r\n\r\n## 3 OTHER USEFUL NOTES\r\n\r\n1. First principles thinking involves \"...drilling down to the basic physics of the situation and building up from there\" (p.99). Approach your problems using this mindset.\r\n\r\n2. One way to show you are listening in meetings, is to parrot back what others are saying as confirmation you've understood what they have said (p.368). This is similar to an approach mentioned in Jordan Peterson's \"12 Rules of Life\", where you need to accurately summarise a person's ideas as you understand them, before conveying your own points.\r\n\r\n3. Here is a list of authors and books mentioned as having been read by the biographee:\r\n\r\n```\r\nAuthors:\r\n* Martin Heideggar\r\n* Friedrich Nietzsche\r\n* Arthur Schopenhauer\r\n\r\nBooks:\r\n* Douglas Adams\r\n  │── \"Hitchhiker's Guide to the Galaxy\" (1979, sci-fi)\r\n* Isaac Asmiov\r\n  │── \"Robots and Empire\" (1985, sci-fi)\r\n  │── \"Foundation\" series (1951-1993, sci-fi)\r\n* Iain Banks\r\n  │── \"Culture\" series (1987-2012, sci-fi)\r\n* Clayton Christensen\r\n  │── \"The Innovator's Dilemma\" (1997, business)\r\n* Winston Churchill\r\n  │── \"The Second World War\" (1948-1953, history)\r\n* Robert Heinlein\r\n  │── \"The Moon Is a Harsh Mistress\" (1966, sci-fi)\r\n* The Onion\r\n  │── \"Our Dumb Century\" (1999, satire)\r\n\r\nMagazines:\r\n* Amazing Stories magazine (1926-1939, sci-fi)\r\n```\r\n\r\n\r\n\r\nThis book is an excellent testament to how belief in humanity, curiosity, intelligence, sheer force of will, luck, and karma can overcome near-impossible odds and make an at-scale tangible difference. It also shows the depth of sacrifice and toll it takes to pursue such a path.\r\n\r\nThe biographee envisions humanity being more technologically advanced than now to achieve species-level self-determination in the universe. His success in making tangible steps toward this explains why his efforts are often widely acclaimed.\r\n\r\nAfter reading it, this book may provoke your surrendered existential nihilism, an existential crisis of self-comparison, or inspiration for positive change--so choose wisely. Personally, I'll opt for the more hopeful outlook.\r\n\r\n\r\n\r\n### Reference\r\n\r\n* **[Elon Musk by Walter Isaacson (2023)](https://www.simonandschuster.com.au/books/Elon-Musk/Walter-Isaacson/9781761427978)**\r\n\r\n\r\n\r\nClick **[here](https://github.com/makuharistudio/makuharistudio.github.io/blob/main/src/markdown/readings/2025-04-20.md)** for this reading page's markdown file in GitHub."
  },
  {
    "id": 1742043600,
    "title": "12 Rules for Life\r",
    "name": "12-rules-for-life",
    "author": "Jordan B. Peterson\r",
    "publisher": "Penguin Random House UK\r",
    "publisherURL": "https://www.penguin.co.uk/books/309610/12-rules-for-life-by-peterson-jordan-b/9780141988511\r",
    "photo": "../assets/readings/12-rules-for-life-by-jordan-b-peterson.png\r",
    "category": "personal development\r",
    "date": "16 March 2025\r",
    "desc": "A philosophical guide on foundational approaches to help live a better life supported with anecdotes from the author's personal life and clinical practice, science, religion, and fiction.\r",
    "tags": "[\"Personal development\", \"Philosophy\"]\r",
    "content": "![12 Rules for Life by Jordan B. Peterson](/src/assets/readings/12-rules-for-life-by-jordan-b-peterson.png)\r\n\r\n\r\n\r\nThis book was name-dropped in the author's YouTube lectures and interviews, so I bought a copy to try it. It is the first non-technical book I read since university, so it was not an easy transition to go from my preferred reading of factual and \"to-the-point\" near-discussionless information, to wading through such philosophical and life-orientated lessons.\r\n\r\nAdmittedly, I nearly dropped the book early on where it discussed the difference between light and darkness, as I felt it lingered too much on that point. I powered through that and was rewarded with interesting anecdotes from the author's life and clinical practice. Being careful not to spoil, the most memorable example for me is when the author and his wife looked after a neighbour's neglected child.\r\n\r\nA part of me wished I had the knowledge in this book at an earlier age in life, but I do wonder if youthful impatience would have prevented me from properly incorporating those lessons.\r\n\r\nThese rules (or variations of them) I had already been aware of and tried living by before finding this book:\r\n\r\n* Rule 1: Have good posture.\r\n* Rule 4: Don't compare yourself to others. \r\n* Rule 6: Fix yourself instead of blaming others.\r\n* Rule 7: Choose the actions that will improve your tomorrow instead of indulging in today's pleasure.\r\n* Rule 8: Avoid lying.\r\n* Rule 9: You don't know everything so try genuinely listening to others.\r\n* Rule 11: Let yourself and others test their limits and be challenged.\r\n* Rule 12: Enjoy the few miraculous and wonderous moments that life gives you.\r\n\r\nThese were the lessons that were new for me:\r\n\r\n* Rule 2: Build the attitude to want to help yourself get a better life, regardless of any self-contempt or self-criticisms you have.\r\n* Rule 3: Surround yourself with people who genuinely strive for their own self-improvement, and expect for your relationships with them to not be easy. It is better than having a supposedly effortless relationship with someone who sees your self-improvement efforts as a fault.\r\n* Rule 5: Discourage behaviours in the people close to you which may lead them to becoming a social disgrace or being mentally immature.\r\n* Rule 10: Communicate your feelings to confront those feelings and what you intend. Even when your efforts to be precise don't solve the problem, at least you will remove the ambiguity which is far worse than the problem.\r\n\r\nBasically, the book encourages you to improve your internal locus of control, by setting your mindset and life in a constructive direction. One recurring way it does this is by confronting people so corrupted by their own nihilism, that they denounce humanity whilst hiding behind a false guise of being anti-prejudice.\r\n\r\nMy favourite quote:\r\n\r\n\"Aim up. Pay attention. Fix what you can fix. Don't be arrogant in your knowledge. Strive for humility, because totalitarian pride manifests itself in intolerance, oppression, torture and death. Become aware of your own insufficiency--your cowardice, malevolence, resentment and hatred. Consider the murderousness of your own spirit before you dare accuse others, and before you attempt to repair the fabric of the world.\" (p.198)\r\n\r\nThe book has a number of other wisdoms, but I'll list only 3 of my other favourites below. The rest you can read the book to discover.\r\n\r\n1. You need to reveal yourself to the world for the best possible version of you to be brought forth into the world (p.212).\r\n2. Make your ambitions based on the building of your character and ability because those will always be with you regardless of status and power which can easily be lost (p.224).\r\n3. Deliberately say the things and go to the places that put you into the new situations needed for you to be switched on and placed on the path to be more complete as an individual (p.212).\r\n\r\nIn summary, the book may be a difficult read for the philosophically uninitiated, but the lessons are good. Truthfully, I prefer to listen to the author's lectures and interviews. They have less content, but there's more conciseness, logical reasoning, and stronger engagement in video format.\r\n\r\n\r\n\r\n### Reference\r\n\r\n* **[12 Rules for Life by Jordan B. Peterson (2018)](https://www.penguin.co.uk/books/309610/12-rules-for-life-by-peterson-jordan-b/9780141988511)**\r\n\r\n\r\n\r\nClick **[here](https://github.com/makuharistudio/makuharistudio.github.io/blob/main/src/markdown/readings/2025-03-16.md)** for this reading page's markdown file in GitHub."
  }
]