[
  {
    "id": 1769778000,
    "title": "The Singapore Story 1923-2015",
    "name": "the-singapore-story-1923-2015",
    "author": "Lee Kuan Yew",
    "publisher": "Marshall Cavendish",
    "publisherURL": "https://marshallcavendish.com/our-books/categories/books/9789814328821",
    "photo": "../assets/readings/the-singapore-story-volume-1-by-lee-kuan-yew.png",
    "category": "history",
    "date": "31 January 2026",
    "desc": "A summary of practical war strategies the author has derived from historical, military, and philsophical lessons with frequent quotations from important figures.",
    "tags": "[\"History\", \"Politics\", \"Strategy\", \"Autobiography\"]",
    "content": "\n![The Singapore Story Memoirs of Lee Kuan Yew 1923-2015 Memorial Edition](/src/assets/readings/the-singapore-story-volume-1-by-lee-kuan-yew.png)\n\n\nCONTINUE FROM SCREENSHOT FOR PAGE\n\n# ALL NOTES\n\n\n* \"...the Japanese government had kidnapped and coerced Korean, Chinese and Filipino women to cater to the needs of the Japanese troops at the war front in China and Southeast Asia\" (p)\nTODO find this page end with\nThe author recounts the Japanese fighting spirit as among the world's finest, but also had the viciousness of Genghis Khan and the Huns'.\n\"I have no doubts about whether the two bombs dropped on Hiroshima\"\n\n* There is a beautifully written quote from a letter by W.S. Thatcher (TODO who is this?) to the author at a time when the author was very eager to find accomodation closer to his fiance as they studied in Cambridge. It very much reminds me of the intelligence, maturity, sensibility, and dry humour I enjoy of this kind of British writing (p.112)\n\n* Secretly getting married whilst in their mid-20s and studying abroad at Cambridge (p.115) was far and wide the sweetest moment in the whole book. Apologies for the spoilers. But going after the girl who outperformed you in at school? That's real man's guts there.\n\n* Best holiday of their lives was in Paris for 5 days then a week in Switzerland (p.116).\n\n* He seems to frequently praise those with logical minds, like \"My best supervisor was Trevor Thomas. He had a crisp, clear, methodical mind\".\n\n* Not needing to pay an optician, nor dentist, nor college doctor in Cambridge for treatment, at most only needing to sign a form gave the author an enormous impression of how a civilised society should be (p.129). The fairness of the British system's endeavour in treating everyone regardless of class, to a decent set of living standards at the time, shortly after the National Health Service Act of 1948 (p.129), later abolished in the mid-1950s. The author realised later on his idealism blinded him to the reality that such a system was too heavy a burden for a government, and that individuals needed to strive to do better for themself, which is \"...the driving force for progress throughout human evolution\" (p.129).\n\n* \"The people as a whole must have self-respect and the will to strive to make a nation of themselves. The task of the leaders must be to provide or create for them a strong framework within which they can learn, work hard, be productive and be rewarded accordingly\" (p.132)\n\n* Misinformation to Special Branch of LKY attending a communist rally in London (p.132)\n\n* Lee Kuan Yew was his public persona, and only those close to him stil called him Harry (p142)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n=======================================================================================\n\n# BOOK itself\n\n* I enjoyed how the book begins where it ends, on page 17 it summarises LKY's actions in the final stages leading to the beginning of Singapore's independence, which ends on he perceives Singaporeans would push to \"...getting Singapore not just towork but to prosper and flourish\" (p.663).\n\n* The book was a very difficult read for me. Not in any part due to the book itself, so much as misalignment or even dare I say weakness of my own character.\n\nFor example, I have lived in what feels to me a very apolitical country. Personality-wise and ambition-wise, the politicians in my home country seem indistinguishable and immemorable.\n\n* Two of my favourite citations the author made was from the Chinese Newspaper Sin Chew Jit Poh, \"In each individual's heart is his own prayer\", and from the Nanyang Siang Pau \"The heart knows without having to announce it\" (p.17).\n\n* He does not baselessly demonise anyone. When I see or hear anyone doing this, I automatically assume they are small-minded and know that the best for society is typically the opposite of whatever they want.\n\n* Defined his public image by beginning with his name. Dropping the Anglo \"Harry\" from it and placing his surname first: \"Lee Kuan Yew became my public persona, what I stood for and saw myself as - a left-wing nationalist...But through all these years, my wife and personal friends still call me Harry\" (p.142)\n\n* Finding out that colourful phrases he has made, like his description of someone as being \"...about as political as a tadpole\" would be kept in Special Branch's files (157)\n\n* Recounting his point blank asking an English Superintendent at Special Branch if the chief sub-editor of a Malayan newspaper was a communist, with the superintendent replying that the editor was the most brilliant of them, but also that \"...people grow up and their minds change with experience. Work on him. He is worth saving\". (p.158)\n\n* In response to LKY's getting carried away with sympathy for Chinese-educated students who allegedly obstructed police during the anti-conscription riots \"I was ignorant, gullible and stupid. I did not know just how efficient the communists were, how their tentacles reached out and controlled every single organisation that was bubbling up against the government\" (p.173)\n\n* Perceiving the young idealist activists who sought a new world of equality and fairness and wanting to harness their dynamic. \"So far, we had links only with the English-educated and the Malays, who did not have the convictions or the energies to match, never mind the will to resist the Chinese-educated communists\" (p.173)\n\n* In his early career, LKY had developrd a reputation as a lawyer who was both political and willing to stand up to the government. This resulted in him being frequently consulted by students, and he never turned them away regardless of the hour of day. \"I wanted to poach in this pond where the fish had been fed and nurtured by the communists, to use hook and line to catch as many as I could\" \"....it was like recruiting police cadets in mafia territory, a hazardous business\" (p.174)\n\n* LKY made every endeavour to fathom the communist methodology, which was \"...a secret network of disciplined cadets grouped in cells of about four, each with a leader\" (p.174)\n\n* Using logic to cut down the reasoning of his opposition. Such as his qualification to be an assemblyman, wherein a candidate who was born and bred in England with 7 years residency in Singapore was allowed canditure, than LKY himself must also be qualified, as he was born and bred in Singapore except 4 years of eduation in Englang, otherwise \"...the world must be square, not round\" (p.183)\n\n* LKY was accused by a Democratic Party rival at a time when he could not read nor write Chinese, that he could not represent the Chinese voter. LKY cleverly countered that his opposition could not read nor write Tamil nor Malay, and therefore could not represent those constituents (p.183)\n\n* LKY had to exaggerate his language skills until he could make up for it (p.183)\n\n* Never forget the position you are in relation to those around you, like your friendly relations are at an expense to you as a convenience for another.\n\n* Feeling retched at the smell of decaying food, filth, and large rats running around certain areas of early Singapore (p.185)\n\n* \"In previous elections for the Legislative Council, the speeches were feeble, tepid, dull, delivered without feeling or conviction, usually in English (p.186)\n\n* When orators spoke in their own dialects, they were more eloquent and passionate, as was the case for the Chinese orators who spoke toward preserving Chinese traditions (p.186).\n\n* \"Hokkiens formed the largest single Chinese community in Singapore\" (p.186)\n\n* Difficulty to use rhetoric when languages differed so much (p.187)\n\n* Personal loyalties to LKY had many people volunteer for his campaign, including postal clerks for distributing manifestos to voters, Hawkers and stallholders also helped in response to LKY getting them off from overpacking animalsdue to Chinese New Year. People who \"...expected nothing in return except to share in my glory\" (p.187)\n\n* LKY outlines how he and Raja were ignorant of guerrilla insurgency and revolution by violence when they sought a general amnesty for the MCY. \"Only later did we realise that the communists would never give up their capacity to use armed force whenever democratic methods failed to win them power...They were superb stage managers, and their cheerleaders had orchestrated prolongued applause for all speakers who attacked the Emergency Regulations and made them appear to be a major issue, since they had to be abolished first if the MCP were to break out into the open and be free to organise the ground\" (p.192)\n\n* David Marshal, LKY descrobes as not understanding the Chinese people, \"...but was extremely anxious to live up to his self-perceived role as a liberal and a socialist bent on freeing Singapore from colonialism\" (p.197).\n\n* William Goode, Chief Secretary of the Legislative assembly, LKY described as a quietly spoken but steely persion, who \"...laughed easily and had a bluff manner\" (p.197)\n\n* LKY recounts how postmen were made to wear trousers with painted red stripes that they felt made them look like circus staff, which prevented the trousers being worn off work hours. LKY negotiated to have them made as red cloth to make them look smart rather than clownish (p.197).\n\n* Goode explained to LKY that the Emergency Regulations were needed to keep the communists from committing terrorist acts including murder, arson, acid-throwing, and other violence which cowed civilians \"..into a conspiracy of silence\", recounting a Chinese boy playing the harmonica who was called out of a music club to be shot dead (p.197)\n\n* In August 1995, the City Council Labour Union, which was predominantly Indian workers who did city cleansing and garbage collection went on strike for back pay they earned the previous year with incidences of violence. They asked for LKY's help but he said only on the condition that they did their strike peacefully. City Council conceded to the union, and the governor reported that LKY was probably the cause of the sudden ceasing of rowdyism and that LKY himself was useful to both sides and improved his personal position from facilitating the settlement (p.210-211)\n\n* LKY admits that his approach of working within the law and still getting results provided a starch contrast to the communists going beyond the law via violence, made his own methods more effective and by comparison more appealing to the British (p.211) STRATEGY\n\n* \"It was the disagreeable alternative the communists posed that made constitutional methods of gentle erosion of colonial authority effective for the nationalists and acceptable to the colonialists. In pre-war India, where there was no communist threat, constitutional methods of passive resistance took decades to work\" (p.211)\n\n* When a crowd turns into a mob, it cannot be controlled (p.227)\n\n* \"I did my best before the London conference to make sure that the constitution would not open the gates for a communist takeover, but would give us enoughroom to build a non-communist government, not as a stooge of the British, but as a protector of the interests of the people\" (p.229)\n\n* \"When young London children called me a Chinaman or a Chink, it did not trouble me. If they meant it as a term of ause, my business was to make them think differently one day\" (p.231).\n\n* LKY spent much of his time with Keng Swee and his lieutenants who were active students that helped him defeat communists, and contacts with London's Labour party (p.231)\n\n* LKY describes Lim Chin Siong (fellow founding member of PAP incarcerated for being communist). \"He was modest, humble and well-behaved, with a dedication to the cause that won my admiration and respect. I wished I had cadres like him. He was like a Gurkha warrant office in the British army - totally loyal, absolutely dependable, always raedy to execute orders to the best of his ability... we recognised each other for what we were. He knew I was not a communist and I knew he was one. And we accepted each other as such\" (p.233)\n\n* One of LKY's most impressionable memories was of David Marshall, a man who was overly idealistic and loud about Singapore's independence too early spoke during a conference whilst the Secretary of State Alan Lennox-Boyd was writing to respond to a cable placed in front of him, and when David demanded his attention, Alan \"...repeated verbatim Marshall's last three sentences. It was a virtuoso performance, very British, quite devastating\" (p.236)\n\n* LKY was highly observant, observing the lessons others painfully learned, and endeavoured to avoid them. For example, Lim Yew Hock was pursuaded by his security officials to be responsible for cleaning up Chinese-educated students involved in communist-instigated riots of 1956 and earning a public perception that he was attacking the Chinese education system as a tool of colonial imperialism. LKY rationalised it would have been better to oblige the parents to take their children from the schools, leaving Special Branch to take the leaders from those remaining and tempted to act illegally (p.250).\n\n* \"Marshall taught me how not to be soft and weak when dealing with the communista. Lim Yew Hock taught me how not to be tough and flat-footed... Of the two, the more valuable lesson was Lim Yew Hock's - how not to let the communists exact a heavy price for putting them down\" (p.251)\n\n* LKY identfied \"...as long as the Chinese middle schools were churning out bright and ambitious graduates whom the political system excluded good jobs in the public and private sectors, the MCP would have a steady flow of recruits. This was the nub of the problkem - the frustration of the able and talented among the Chinese-educated who had no outlets for their energy and idealism, and who were at the same time inspired by the example of the young communist cadres in China\" (p.254)\n\n* Adding to the myth were Lim Chin Siong and Fong, who through \"...an ostentatious display of self-sacrifice by their leading cadres... [who] would sleep on top of the desks at union headquarters. Their spartan lifestyle had a tremendous impact on their followers, who tried to emulate them, infecting each other with the same spirit of self-denial... It was a competitive display of selflessness that swept a whole generation; the more selfless you were, the more you impressed the masses\" (p.254)\n\n* Whilst the communists gave themselves, even young women giving their bodies to illicit love to star performers and branch leaders of the communists, by comparison, LKY ha not a much dedication from people on his side. He equated the work of 4 of his own volunteers to the 1 on the opposing side. \"I used to be quite depressed by the long-term implications of all this. I failed to realise then that they could not keep it up for long. Revolutionary zeal could only carry them thus far. In the end, they had to love and bring up families, and families required money, housing, health care, recreation and the other good things of life.\" (p.255)\n\n* \"One odd thig about them though, was that when they abandoned communism... they often became extremely avaricious to make up for lost time. They seemed to feel they had been robbed of the best years of their lives and had to make up for what they missed... When the revolution did not deliver the utopia and economy reverted to the free market, cadres... were the first to be corrupt and exploit the masses\" (p.255)\n\n* Great strategy: p.268\n  At a time when pro-communists were part of the PAP for mass support.\n  Pro-communists could use the tempermental David Marshall as cover, but LKY suspected they knew he was no good for the long-term.\n  LKY and friends leaked their intention to pursue a non-communist Malaya to Straits Times.\n  The pro-communists intended to capture the PAP\n  If LKY and his colleagues tried to take over, they wouldn't be able to implement their policies with the large communist presence in the party.\n  LKY \"I calculated that Lim Yew Hock was unlikely to leave these people in charge for long... but that would still allow the CUF time to rebuilt its strength in the unions and the party\" (p.269).\n  So LKY and his close colleagues signed a statement that they would not pursue the top positions of PAP on the basis of lacking the moral right, imlying they knew what it would entail for the people.\n  \"The pro-communists were non-plussed. They had not thought their tactics through\" (p.270)\n  \"...we decided to leave them in charge so that any pro-communist act they committed would be entirely on their own account\" (p.270)\n  The pro-communists pleaded with LKY's team to take the top positions, but LKY's team refused to be front men for their agenda.\n  LKY estimated it would take 6 months to a year for the communists to get themselves into trouble.\n  It only took 10 days, as Jamit Singh had made moves to absor Lim Yew Hock's mass base (Singapore Trade Union Congress) with their SGEU, so Lim Yew Hock moved to arrest almost all the pro-communists on the central executive committe. (p.270)\n  But LKY's non-communist team were perceived to be involved with the arrests and traitors to their pro-communist colleagues, and LKY had to point out in an Assembly to deplore the innaccuracies of a government white paper, that Lim Yew Hock moved to save his own position (p.271)\n  \n* LKY offered Lim Yew Hock ideas to prolong the life of his government at a time when Lim knew his standing with voters was damaged.\n  - Postpone the polls on the basis of legislating:\n    - delineation of constituencies from 25 to 51\n    - making voting compulsory (to take the advantage of enthusiastic attendance from the communists)\n    - forbid use of cars to carry voters to polling stations, and advantage for the wealthy (p.279)\n  But LKY used that time for LKY to clean up the PAP\n\n* After visiting Rome, LKY proposed that elections to the central executive committee CEC (the core of the PAP) be based on the Pope's election, by amending the constitution to define 2 classes of party membership, ordinary and cadre, where cadre members would be approved by the CEC. In this way the PAP had a closed circuit to prevent the party from being captured (p.287).\n\n* Other parties campaigning against PAP would be demoralised by the fact that \"...bookies were already taking bets on the number of seats we would win by\" (p.296).\n\n* In Imperial China, barners were not eligible for imperil exams, and PP took advantage of this by breaking tradition and fielding 3 Chinese barbers (p.296)\n\n* LKY expresses that he sensed :...that the Tunku and his colleagues in Kuala Lumpur did not view the prospect of a \"non-communist\" PAP victory in Singapore kindly\" and LKY himself was pressed by Malay \"...to be explicitly anti-communist\" (p.296).\n\n* LKY was quoted regarding their policy that press was not to be foreign-owned purveying their own line: \"Any newspaper that tries to sour up or strain relations between the Federation of Malaya and Singapore after May 30 will go in for subversion. Any editor, leader writer, subeditor or reporter who goes along this line will be taken in under the Preservation of Public Security Ordinance. We will put him in and keep him in\" (p.299)\n\n* By carefully choosing Chinese educated nominees into the PAP, LKY minimised the risk of opposing pro-communist parties from controlling the election (p.299).\n\n* Although LKY's repeating of English or Malay words into Mandarin may have been less elegant, he and Chin Chye who was also weak in Mandaron, earned the respect of the CHinese-speaking for working hard at their language (p.300).\n\n* During a PAP campaign, \"Keng Swee was dreadful; with a first-class mind, he prepared his speeches meticulously, but delivered them in a dull monotone, mumbling, reading from a script, and looking bored\" (p.300)\n\n* \"In a multiracial society, we had one inescapable problem. Some of our candidates might be natural open-air orators, but no one could make a speech at an election rally and move the whole audience... only ne section of the crowd could understand him at any one time, so he had to reach the others through gestures, facial expressions and his tone of voice\" (p.300)\n\n* LKY cites a Malay proverb mentioned by PAP colleague Yaacob bin Mohamed during a campaign \"A hen lays one egg, the whole village hears her cackles; a turtle lays eggs by the hundred, not a sound is heard\", implying PAP brought many benefits but never boasted about it (p.300-301)\n\n* LKY lived during a time where \"THe old order had lost its hold, society was in a state f flux, and many uneducated men and women from the working class seized the chance to climb to the top through sheer ability, energy, and luck (p.301)\n\n* How abslutely vital neworking and diplomacy is. His entire life moved around this. PERSONAL NOTE\n\n* Interesting example of how circumstance of the people guided policy, liek how LKY expressed they did not seek independence for Singapore and that British would retain sovereignty over their bases, which reassured 45,000 mostly Indian workers who came with British forces (p.304).\n\nIMPORTANT FOR STRATEGY\n* At a Clifford Pier rally, LKY expressed the two extreme options, where \"Marshall had vacillated, been chased from pillar to post, and retreated in the face of each communist-led demonstration; how on the other hand Lim Yew Hock had used the big stick and the gun, until the British and their helicopters took over. I said bravely, \"THe PAP government will not fall into either of these errors. We shall not be intimdated or browbeaten, nor will we use repression as the means of government. We shall govern with the will and support of the people, firmly, wisely, and justly\" (p.304)\n\nSTRATEGY\n* Keeping your word even if it may conceivably bite you in the ass. LKY wanted to release the pro-communist detainees whom he had negotiated with to not be overtly communist, and got London's agreement. But LKY strategically needed to get thedetained pro-communist's public endorsement of PAP's non-communist aims get full press coverage before PAP got sworn in and such a way that the headlines did not compete. Goode disagrees, but LKY insisted and had his way (p.308)\n\n* During a rally, LKY chose it to temper and dampen the large crowd's hopes as a way to prepare to defend against communist attacks that would \"push for more freedom to subvert Singapore and to use their strength on the island to help the revolution in Malaya (p.308).\n\n* In a speech LKY made: \"The good things of life do not fall from the skies. They can only come by hard work and over a long time. The dovernment cannot produce results unless the people support and sustain the work of the government. ... There may be times when, in the interests of the whole community, we may have to take steps that are unpopular with a section of the community. On such occasions, remember that the principle which guides our actions is that the paramount interest of the whole community must prevail\" (p.309).\n\n* Keng Swee pointed out an example of these, the English-educated, warning them that they would lose privileges they enjoyed under the British and would have to compete on equal terms with evereyone else, and that this was not due to political machination, but by trememndous social force (p.309)\n\n* \"The Straits Times and Singapore Standard had never published fair reports of our analysis of the causes of the political turmoil, and in consequence we had never been able to get the English-educated to understand\" (p.309)\n\n* Keng Swee proposed the cutting of ministerial salaries, \"...to set the tone for thrift and financial discipline from the start... The English-educated believed we had set out to punish them for having voted gainst us... We wanted to show everyone in Singapore... that for the public good, the English-educated were prepared to make sacrifices... to help us get the message across that, in this new era, we would all share hardships and joys equally\" (p.318). Civil service unions created a council to confront the PAP on this, but because the Chinese-speaking majority were behind the PAP's action for the pay cut, the council never took off (p.319)\n\n* LKY expressed exasperation toward the civil service unions, as it indicated their insufficient grasp of the challenges ahead. Some senior officials had to give up their maids, but that was nothing in the face of the perils ahead (p.319)\n\n* In LKY's frst speech as prime minister in the Assembly, he warned that failure of the PAP leaves no real democratic alternative, and brute force would inevitably arise (p.319)\n\n* \"One problem I had was getting ued to power... I warned my ministers... not to get drunk on power and not to abuse it. It was easier said than done, and on many occasions we still antagonised civil servants\" (p.322)\n\nSTRATEGY COPYING\n* LKY's team was determined to move quickly during their post-election popularity. \"We mounted a series of well-publicised campaigns to clean the streets of the city, clear the beaches of debris and cut the wees on unkempt vacant land. It was a copycat exercise borrowed from the communists - ostentatious mobilisation of everyone including ministers to toil with ther hands and soil their clothes in orser to serve the people. We saw no readon why the MCP should have the monopoly of such techniques and organised drives to enthuse the people and involve them in setting higher standards in civic consciousness, general cleanliness and the preservation of public property\" (p.322)\n\n* LKY and Keng Swee built over a hundred community centres in the city and rural areas for education and recreation supervised by the Social Welfare Department that functioned as a community development department \"...to give people something positive to do, and get them lined up on the side of law and order\" (p.324)\n\n* \"We organised a Works Brigade to take in unemployed young men and women, put them in semi-military uniforms, house them in wooden barracks and teach them farming, road building, bricklaying and construction work - generally to put some discipline into them and, most important, o get them off the streets\" (p.324)\n\nCOPYING THE WORLD\n* \"...we badly needed to establish a grip on the unions under communist control to stop their political strikes\", and addressed this by reaching out to Australia's secretary for the ministry of labour, Harry Bland,  to set up a court for compulsory arbitration procedures that kept tempers in heck, a model that gave Australia good industrial relations (p.324)\n\nPERSONAL: The importance of knowing your conditions thoroughly, as you can come up with solutions that may address several issues at once\n\n* Failing to find a PAP woman member who would be good enough to perform an English broadcast on the PAP's policy on women's rights and emancipation, which were necessary to have them fully contribute to society, which went against the backwardness of most of Asia, they resorted to asking Choo to perform the duty (p.325)\n\n* Importance of skip meetings. LKY had meetings with a newly appointed director John Linsell who didn't seem to have the subtlety needed to understand communist tactics and strategy, so LKY organised meetings with Linsell to include two of his senior officers Richard Corridon and Ahmad Khan who were more shrewd and perceptive on the communists (p.329).\n\n\ncontinue from page 338\n\n -- find out who quoted this\n\n\nBooks mentioned\n\n* \"Mandarin Made Easy\" by Chiang Ker Chiu (p.61)\n* \"Mrs Lee's Cookbook\" <-- LKY's mother's book (p.65)\n* \"Cooking in a Bed-sitter\" <-- might not be real, (p.102)\n* \"The Story of Zoya and Shura\" by L. Kosmodemyanskaya <-- given to LKY from communist Lim Chin Sion (p.233)\n* \"Disputed Barricades\" by Fitroy Maclean (p.234) <-- LKY found fascinating\n* \"Socialism for Guinea\" by Sekou Toure (p.530) <-- Several volumes from the author given to LKY\n* \"Looking Back (1977)\" by Tunku Abdul Rahman (p.643)\n* \"The Labour Government 1964-1970\" by Harold Wilson (p.657)\n\n\n\n\n\n## POLITICAL DEFINITIONS\n\n* crypto-communitst (p.132, 142) undefined\n\n## CONTEXT\n\n\n## PLAYERS\n\nOrganisations\n* Malaysian Solidary Convention (MSC) - stood for a non-communal Malaysia by LKY (p.17)\n* United Malays National Organisation (UMNO) - group around the Tunku who rules Alliance is dominated by these people (p.17)\n\nPeople\n* \"Toh Chin Chye, a science student one year my senior, hardworking, systematic, quiet and consistent\" (p.43) <-- I feel an affinity based on this description\n* \"Goh Ken Swee,  a tutor in economics with a first-class mind, a poor speaker but a crisp writer\" (p.43)\n\n\n## GRAND STRATEGY\n\n\n\nChoosing a side is the worst strategy.\nBecause when that side does something inconceivably stupid, which is inevitable\nLike an individual human being, every side contains a good and bad to it.\nTake the good parts of every \"side\", and keep the bad\n\n\n\nI can't shake off from my mind that Lee Kuan Yew anticipated everything.\nHe understood people.\nHe understood how different cultures guided their actions.\nHe kept abreast on the situations.\n\nAs one \n\nBut could this have been a deliberate choice in writing?\nThere are advantages to doing so?\n1. to demonstrate personal humility\n2. to avoid slighting those whom he has successfully outwitted, thus minimising friction between nations for future leaders of Singapore\n3. \n\nIt wouldn't surprise me if this may be one reason no true biopic film has been made of the author.\nBecause of this unknown possibility and the implications of choosing how to portray him.\n\n\n\nTHe importance of knowing what words actually mean, and not the popular insinuations of their meaning, and not to overlap them (special phrase for this)\n\nFor example, I have never known the difference between socialism and communism.\n\n\nHere is a list of key words:\n\n\n\n\nAlthough it is my first book regarding applied strategy, I would not be surprised if it ends up being the best I'll ever read.\n\nBecause there is so much mystery which is understandable.\n\nHow far ahead into the future did LKY see?\nTactics are only success\n\n\n\nI had to put this book down many times.\nSimply because imagining the numerous situations that the author had placed himself in would be a headache.\nHaving to deal with overly emotional, and otherwise the worse parts of society, in order to forge a diamond from the rough.\n\nThroughout my life I have been apolitical.\nRaised in Australia, I couldn't tell the difference between my own country's major parties, especially the politicians as they all seemed similar.\nI only understood that one was more adept at business and the other social welfare.\n\nBut this book has shown me the importance of politics in determining a country's success.\nIf you have short-sighted and power/money hungry people at the helm, you will have a leech like society.\nIf you have people at the helm who loong far into the future and align it with actions taken now, then you will get a betterment of society.\n\nI've never really been much of a student of history.\nHistory is meant to be a point to learn lessons from.\nBut for people who are a little poorer of memory like me, the\nMostly because of an arrogant belief that if one simply casts aside their ego and emotions, and just look at the situation objectively, they will get to the best possible answer.\nBut now I understand that history shouldn't be merely that. Merely a source of NOT doing something.\nIt should be a source of inspiration.\n\n\nAs I was reading this book, I couldn't help but make a mental association to that character from Shogun. How he simply saw which way the winds were blowing and followed that.\n\n\n\n\nOne thing that will forever remain a mystery to me is why there are constant antagonists that get in the way of obvious good? Are they so narrow-minded and self-serving to see the bigger picture?\nOr are they simply driven by some pessimism that like to watch the word burn around them.\nSuch people are an inevitablity in societies.\n\n\n\nI have not read anything of any other politician.\nBut reading this book already leads me to believe he was the best politician and nation .\n\nI bought this book under the misperception that I would see the nation building aspect of his efforts. But everything in this book was simply laying the cement, the foundations for the nation building. And it couldn't have been more crucial.\n\n\n### Reference\n\n* **[The Singapore Story: Memoirs of Lee Kuan Yew 1923-2015 Memorial Edition by Lee Kuan Yew (2015)](https://marshallcavendish.com/our-books/categories/books/9789814328821)**\n\n\n\nClick **[here](https://github.com/makuharistudio/makuharistudio.github.io/blob/main/src/markdown/readings/2025-12-15.md)** for this reading page's markdown file in GitHub."
  },
  {
    "id": 1753884000,
    "title": "The Concise 33 Strategies of War",
    "name": "the-concise-33-strategies-of-war",
    "author": "Robert Greene",
    "publisher": "Profile Books",
    "publisherURL": "https://profilebooks.com/work/the-concise-33-strategies-of-war",
    "photo": "../assets/readings/the-concise-33-strategies-of-war-by-robert-greene.png",
    "category": "personal development",
    "date": "31 July 2025",
    "desc": "A summary of practical war strategies the author has derived from historical, military, and philosophical lessons with frequent quotations from important figures.",
    "tags": "[\"Personal development\", \"Strategy\", \"Military\"]",
    "content": "\n![The Concise 33 Strategies of War by Robert Greene](/src/assets/readings/the-concise-33-strategies-of-war-by-robert-greene.png)\n\n\nThis book succinctly outlines 33 strategies of war derived from global military history and organised into five warfare approaches, progressing from areas of greatest control, namely yourself, to your team, and finally towards the enemy.\n\n## 1. Self-directed\n\nSet as the first warfare approach because everything begins from within. You must clearly define who your enemies are and force yourself into conflicts without losing your cool. The purpose of this is to cultivate an adaptable mindset that fights with everything you have and prevents you from falling into predictable strategic patterns (p.6-7, 10-13, 15-17, 21-24).\n\n## 2. Team\n\nNext is to establish the team around you. The author discusses weeding out internal team weaknesses, including self-interested political people, the illogical groupthink from shared leadership, and those who go against the team's morale (p.40-44). This can be accomplished by keeping a tight hold of your command whilst remaining visibly fair (p.29-32). As your team gets larger, you can segregate it into smaller teams with each given an overall goal and the freedom of means to achieve it, but without losing discipline (p.36-37).\n\n## 3. Defensive\n\nThis warfare is about strategies to avoid being attacked, or if you are forced to engage, then to do so economically such that you expend yourself only up to where your blows on the enemy count without wearing yourself out (p.51-52). This is often achieved through deceptive or propaganda tactics to deter attacks, such as intimidating the enemy with your reputation for unpredictability and irrationality (p.62-65). This warfare is also a way to control the flow of battle, such as coaxing your enemy's unmanageable emotions so they attack first and limit their next move, or by willing to sacrifice territory to buy yourself time (p.58, 68-69).\n\n## 4. Offensive\n\nDefine your ultimate goal and take subtle steps towards it so your enemy cannot read and subvert your intent (p.78). Be prudent and unemotional by widening your perspectives to include those of your enemy's (p.73, 78). You'll develop the ability to see the everyday hints of other people's subconscious intents, thereby gathering more information on your changing enemy (p.83-85). Use that information to strike their weak points, which then builds your army's morale and momentum (p.88-89).\n\nThis constant search for strategies to exploit enemy weaknesses makes this fourth form of warfare about subtly diverting your enemy toward your desired direction without them realising, using strategies like baiting them into traps, forcing them on the defense, and fighting them on your terms (p.94-95). Other strategies include:\n\n* Identifying your enemy's crutches based on the principle that every strength is its own weakness, and find ways to remove those crutches (p.98-99). \n* Using divide-and-conquer effectively by separating leaders from their people (p.103).\n* Coaxing your enemy into revealing their flanks, then striking said flank (p.106-107).\n* Enveloping your enemy without revealing your true form so that your attacks seem too formless or \"vaporous\" to retaliate against (p.111).\n* Flexibly plan multiple potential branch paths for effective manoeuvre warfare (p.116).\n* Negotiate with unrelenting pressure, convincing the enemy that it's in their interest and they have no choice but to engage (p.120).\n\nLastly, the author emphasises the importance of how you end a war, noting that, win or lose, you must avoid worsening its conclusion, as it shapes your position for future conflicts (p.128).\n\n\n## 5. Unconventional\n\nUnconventional warfare demands abandoning moral purity, adopting a cunning perspective to avoid defeat (p.132). Here are some of the strategies the author discusses:\n\n* Every form of conventional warfare mentioned so far has involved deception, but unconventional warfare explicitly involves deceiving your enemy's perception with camouflage and decoys (p.135-136).\n* Maintain a constant cycle of conventional and unconventional warfare, being fully aware that the unconventional inevitably becomes conventional (p.142-143).\n* Using guerilla warfare to cause maximum disorder over time, leveraging your enemy's easy-to-anger disposition by being a non-central target that's difficult for them to find and engage (p.156-157). This strategy relies on psychological attrition through elusive, non-conventional engagement, but you must be cautious if your enemy employs a scorched-earth counterinsurgency policy.\n* Build your alliances based on need rather than on loyalty or shared values, which also necessitates building a reputation for being a beneficial ally (p.161-162).\n* Lastly, the book discusses using sporadic acts of terror to sow constant fear in an enemy, and countermeasures against it (p.189-194).\n\nUnconventional warfare is inescapable, as you must always contend with both external and internal enemies. The author exemplifies the latter in work colleagues who seek to undermine you, as your war against them needs daily unconventional methodology such as only lightly opening your enemy's psychological wounds enough that they self-destruct whilst you keep your hands clean. This is what the author poetically describes as letting your enemies fall on their own swords, rather than yours (p.166-168).\n\nWriting a summary of a book that is already an excellent summary in and of itself felt strange, but I wanted to try.\n\nThis book has no anecdotal stories, which makes sense as it serves as a handy portable guide, though there are brief side quotations from historic figures scattered throughout. I want to keep this book for that practicality, but I'll probably additionally buy the full version as I want to see where the author derived his strategies and lessons from.\n\nI was able to connect several lessons to my own experiences.\n\nFor example, the \"Negotiate while advancing\" chapter reminded me of my first year in university. In one class students participated in a negotiation activity pitting them in teams against each other to achieve prescribed goals. The students unknowingly adopted one of two negotiator types cited by the author from Harold Nicolson: warrior or shopkeeper, with negotiations often failing when one side mistakenly adopted the shopkeeper stance. I only really learned where that lesson was trying to go in retrospect through this book, which is you must be willing to become a warrior even if you are a shopkeeper at heart, and also be willing to inflict bad publicity against your counterpart (p.121-122).\n\nAnother of the author's lessons was one I discovered at work, which is that when communicating with others, try to get them to arrive at the conclusion as an achievement experience with you leading them, rather than you just telling them the answer and leaving them with a sense of inferiority (p.176). My work involved a lot of troubleshooting so I had to guide new and occasionally less systematic employees in developing their ability to question their own underlying assumptions and thoroughly investigate towards problem resolutions. I found that the more engaged they were with that process, the more they internalised it.\n\nThe book’s core lesson is that war is judged almost entirely by its outcome (p.178), and it outlines historically effective strategies to achieve those results. Whether it is deceiving an enemy or even a trusted ally, war and life in general involves using people to advance ourselves and there is no need to feel guilty about this human necessity (p.160).\n\nWith the seriousness out of the way, I couldn't help but be amused at one analogy on how to be a formless enemy like the mosquito, which \"...give you nothing but an irritating whir in the ear, from all sides and angles... and you realize that the only solution is to stop fighting and move as far away as possible\" (p.158). I recently encountered one, and realised there are many solutions. One that worked for me was to expose only one part of my skin to lure the mosquito in, then I used a water spray to incapacitate its wings and watched it fall helplessly to the ground where it then met my boot. The irony wasn't lost on me that I used the author's lesson on using an enemy's strength against them.\n\n\n\n### Reference\n\n* **[The Concise 33 Strategies of War by Robert Greene (2008)](https://profilebooks.com/work/the-concise-33-strategies-of-war)**\n\n\n\nClick **[here](https://github.com/makuharistudio/makuharistudio.github.io/blob/main/src/markdown/readings/2025-07-31.md)** for this reading page's markdown file in GitHub."
  },
  {
    "id": 1749996000,
    "title": "Mastery",
    "name": "mastery",
    "author": "Robert Greene",
    "publisher": "Profile Books",
    "publisherURL": "https://profilebooks.com/work/mastery",
    "photo": "../assets/readings/mastery-by-robert-greene.png",
    "category": "personal development",
    "date": "16 June 2025",
    "desc": "An exploration into how to determine your Life's Task and strategies to accomplishing it with anecdotes of the journeys of key historical masters.",
    "tags": "[\"Personal development\", \"Business\"]",
    "content": "\n![Mastery by Robert Greene](/src/assets/readings/mastery-by-robert-greene.png)\n\n\nThis book covers the author's strategies on finding your Life's Task and navigating the phases to achieve mastery for that task.\n\nIt was not until some time into writing this post that I found the \"Concise\" versions of the author's books which render the summarising part of my effort essentially moot, but I continued to finish this post. I realised this when I was buying my next book, \"The Concise 33 Strategies of War\" and compared it to its non-concise version. Essentially, the author's standard books are what you want to read because they include more anecdotes, whereas the Concise ones are what you need as a portable guide.\n\nI highly recommend this book. So much so that I feel like it should be mandatory high school reading. Or at least its principles should be taught earlier on in life.\n\nThe first step is to fight off social conformity and other influences to find your own **\"Life's Task\"**, and to do it efficiently by throwing aside the past, false paths, and exhaustive fights over limited resources (p.26-32, 35-40). Extraordinary people are clearly loyal to their calling (p.45-46).\n\nThe second step is to get into an **Apprenticeship** phase to learn the basic rules and skills needed to achieve your Life's Task, starting by setting aside your ego to genuinely learn, gaining hands-on experience, and open yourself to criticism so you can improve (p.56-63). The author also emphasises that this phase is accelerated with two things: \n1. Having a good **mentor** who encourages your separation from them once you've learned all you need and remains a lifelong ally (p.100), and\n2. Being **socially intelligent** enough to let others live as they are without trying to change them (p.125, 130, 137), and effectively deal with people who have any negative behaviours threatening your pursuits including envy, conformism, rigidity, self-obsessiveness, laziness, emotional flip-flop, and passive aggressiveness (p.141-145).\n\nOnce you have a comprehensive understanding of the field, the third step is to experiment in a **Creative-Active** phase by going beyond the disengaged, conventional, and consumerist mindset of adulthood, and develop a child-like creative mindset (p.175-178). You get to this by choosing a **Creative Task** that maximises your skills, dropping your judgmentalism for a holistic perspective, developing strategies to persevere through lulls in enthusiasm, and allowing serendipity to be a part of your creative process (p.179-245).\n\nThe fourth step of **Mastery** is characterised by your having a high-level intuition of your field built on your deep immersion, knowledge, experience, emotional stability, and discipline which also lets you create connections with other disciplines and physically change the real world (p.261-269). It also involves developing one's own \"X factor\" that forges their path to mastery, which can take the form of primal sensing, leveraging your innate strengths, practicing until your skills are automatic, and investing time into the details (p.269-309).\n\nFailing to pursue mastery or denying its existence leads to feelings of powerlessness, disappointment, and enslavement to a false version of yourself which is constructed from other people trying to make you conform to their ideas, including your own self-deception that such mastery is only for geniuses. Do not waste your uniqueness. Find the most fundamental and natural inclinations you have, and express them as you pursue mastery (p.309-310).\n\nThis book feels like a sign post for those of us in the 99% of humanity who give up on ourselves, and shows how people who started off at the same or worse baselines than us, were able to craft themselves into masters. The principles and multitude of strategies in it are timeless, and really should be mandatory reading.\n\nAs a self-development book, this one felt more goal-oriented than the \"12 Rules for Life\" by Jordan Peterson which felt more for daily living. Though I prefer this book for its ease of reading and its mission-based intent.\n\nLike most when I was young, I was fed the preconceptions of having to get into university and then get a job, without questioning why we had to do things that way. I feel it is more honest to say upfront that life is not a fixed path you have to follow, that opportunities are all around you no matter the age, and you need to seize them. That point is what makes this book work tremendously well.\n\nYou only have one life, and all the circumstances leading up to your existence were highly improbable, so use it for the core of who you are, not for what others want you to be.\n\nIn terms of anecdotes, my favourites included:\n\n* Leonardo da Vinci's study into single piece moulding of a bronze statue which was reminiscent of Elon Musk's idea for Tesla's chassis to be made of a single piece based on a toy car (p.24).\n\n* Cesar Rodriguez who trusted the process of training and pushing himself, going from a benched panicked pilot, to becoming nicknamed the \"Last American Ace\" fighter pilot (p.77).\n\n* William Harvey's approach of thoroughly testing his hypothesis before pushing it onto others:\n  - He wisely confided his discoveries to the King early on to gain his trust and support.\n  - Behaved humbly and with self-deprecation\n  - Played the role of court diplomat and avoided aligning with any faction nor got involved in intrigue (p.150).\n\nThe book has a number of other wisdoms, but I'll list only 3 of my favourites below. You can read the book to discover more.\n\n1. \"In the future, the great division will be between ... those who can acquire skills and discipline their minds and those who are irrevocably distracted by all the media around them and can never focus enough to learn\" (p.64).\n\n2. \"The very desire to find shortcuts makes you eminently unsuited for any kind of mastery\" (p.90).\n\n3. \"The problem with all students, ...is that they inevitably stop somewhere. They hear an idea and hold on to it until it becomes dead; they want to flatter themselves that they know the truth. But true Zen never stops ... everyone must constantly be pushed to the abyss, starting over and feeling their utter worthlessness... Without suffering and doubts, the mind will come to rest on clichés and stay there, until the spirit dies as well...You must continually start over and challenge yourself\" (p.115). \n\n\n\n### Reference\n\n* **[Mastery by Robert Greene (2012)](https://profilebooks.com/work/mastery)**\n\n\n\nClick **[here](https://github.com/makuharistudio/makuharistudio.github.io/blob/main/src/markdown/readings/2025-06-16.md)** for this reading page's markdown file in GitHub."
  },
  {
    "id": 1745071200,
    "title": "Elon Musk",
    "name": "elon-musk",
    "author": "Walter Isaacson",
    "publisher": "Simon & Schuster",
    "publisherURL": "https://www.simonandschuster.com.au/books/Elon-Musk/Walter-Isaacson/9781761427978",
    "photo": "../assets/readings/elon-musk-by-walter-isaacson.png",
    "category": "biography",
    "date": "20 April 2025",
    "desc": "A chronicle of Elon Musk's journey from a difficult childhood to his successive founding of multiple industry-redefining companies up until the early establishing of X.AI in 2023.",
    "tags": "[\"Biography\", \"Technology\", \"Business\"]",
    "content": "\n![Elon Musk by Walter Isaacson](/src/assets/readings/elon-musk-by-walter-isaacson.png)\n\n\n\nThis book chronicles the biographee's life from a challenging childhood to the founding of multiple companies that revolutionised key technology industries.\n\nThis is the first biography I ever read, and it was difficult because I found the idea of biographies to be uncomfortably intrusive. However, my curiosity to understand how someone who has achieved so much in a single lifetime in multiple highly intellectual fields can possibly exist won me over.\n\nBefore reading this book, my initial knowledge on the biographee was very superficial as I had only seen a few interview clips on YouTube. After reading this book, I better appreciate how ridiculously rare he is as an individual, and can see why some conspiracy theorists and Internet meme creators may equate this rarity to him being an extraterrestrial. I am happy to have that superstitious veil lifted and to see the extreme effort and sacrifices needed to create a paragon of human endeavour.\n\nThe biographee has been through many misfortunes that may otherwise be enough to cause other people to give into darker life paths. So to remain on his path in building the at-scale foundations for a better future despite these tribulations is amazing and proof he's living a full life:\n\n- Born into a country where daily fatal violence in public areas is the norm.\n- Physically bullied to near death as a child.\n- Impacted by a challenging relationship with a now estranged father since childhood.\n- Divorced mother who worked multiple jobs to make ends meet.\n- Unable to make friends until he started university.\n- Passing away of his first-born infant son.\n- His political enemies manipulating one of his other children, causing estrangement between them.\n- Romantic breakup leading to severe depression and impacting work performance.\n- An ongoing neck injury.\n- A seemingly chaotic-good alignment that constantly desires being in intense situations.\n\nThe problem with reviewing biographies is the misplaced tendency to judge the biographee as a person, rather than the biography as a book.\n\nThe book is an engaging mix of dramatic, heartfelt, and humorous anecdotes. Whilst the author occasionally expresses misgivings like describing the biographee's ability to present his vision \"as a mandate from heaven\" (p.94), the overall narrative feels balanced because of that tension. The author remains committed to presenting an honest account, allowing readers to interpret the contradictions for themselves.\n\nI've decided to encapsulate some of the business-related lessons from the book in areas like leadership, team dynamics, communication, etc. for ease of personal reference. This book has a multitude of other lessons in morality, integrity, relationships, politics, and more, but those and the anecdotes won't be covered here. Please refer to the book for that information.\n\n\n\n## PERSONAL MINDSET\n\n### Define who you are\nFind the thing you want to do which will have the most impact because pursuing that may be the best way to spend your life, rather than on something else you may enjoy doing or are good at but has low impact (p.56). Once you've identified that, then identify if you are okay working for other people to pursue it, or if you prefer having people work for you, so you can commit to that preference earlier on in life (p.48).\n\n### Learn by risk-taking\nDo not base your decisions out of fear of something, instead use the risk as your fuel to push yourself forward (p.25, 252). Even when your risk-taking fails, do your best to make every bad situation salvageable (p.116). When your risk-taking succeeds, don't waste the wealth earned from it into short-term pleasures that achieve nothing, invest it back into the game of life and play again (p.67).\n\n### Use objective and iterative problem-solving\nKnow when to step back from your emotions and to reframe a problem (p.99 & 247). Take an iterative approach and learn by failing with the attitude of quickly getting back up to identify each successive problem so you can fix them (p.114). Have the humility to accept being wrong, just don't be confidently wrong (p.286).\n\n###\t\"Polytopia life lessons\"\nPolytopia is a video game that the biographee recommended to his brother on learning how to be a CEO, and these are key lessons from the game (p.426-427)\n1.\tEmpathy is a liability in business.\n2.\t\"Play life like a game\".\n3.\tLosing is inevitable and will happen many times. Get used to it so you become fearless and take more risks.\n4.\tBe proactive and take charge of setting the strategy.\n5.\tOptimise every turn you have in life, and let nothing slide.\n6.\tPut everything back into the game to grow.\n7.\tPick your battles carefully by using front minimisation tactics.\n8.\tUnplug at times by removing distractions.\n\n\n\n## STRATEGY AND VISION\n\n### Define a broad business mission\nWhen your company mission is important enough, optimism and pessimism are irrelevant. All that matters is taking the steps forward to achieve the mission, then work backward to figure out how to make it work financially (p.177 & 93). Make the mission broad like an innovation company, which is also advantageous in that any future acquisitions or mergers will be less challenged for being in line with the core innovation mission (p.254-257).\n\n### Find entrepreneurial opportunities\nDo not let incumbent industry mindset inhibit you from seeing opportunities in that industry (p.48). For example, figure out the reasons why that industry isn't doing well, and simplify the process for the customer by taking on the legwork to fix those problems (p.252). Be open to other business models to side-fund your main model, like selling a component your supply chain makes to another business, tying different endeavours together into a new one, or using data collected for a new purpose (p.193, 243-244).\n\n### Build a company attitude of anti-complacency\nA \"maniacal sense of urgency\" is needed as an operating principle for companies to avoid being flabby and slow because complacency can be a scourge to business (p.286, 349, 508). If your company is already too conservative and long-lived, quickly accept that you need to change, and adopt entrepreneurial efforts (p.222).\n\n### Be a product company, not a sales nor a platform company\nA platform company is merely an unbranded vendor for incumbent industry leaders (p.63-65), and a sales company neglects the philosophy that you should make a great product then let the sales follow up by themselves after that (p.253). So, it is important to be product-first. For high-cost industries, you can create a high-price and quality iteration before designing a mass-market model (p.127). You can also more easily gain public awareness by displaying prototypes to the public (p.121, 194).\n\n\n\n## LEADERSHIP\n\n### Lead by example, not by empathy\nAn effective leader is like a general on a battlefield, they need hands-on experience on the factory floor and be willing to do what they asked of the workers, otherwise they shouldn't ask the workers to do those things in the first place (p.285-286, 480). They have the openness to take in the risk information and data from their team, the flexibility to have their mind changed by the evidence, the decisiveness to make quick assessments and shift responsibility from the team to themselves, and the resolve to take ownership for their mistakes even if it needs to be done publicly (p.210, 282, 407). It is not the leader's job to make people love them, as that just leads to counterproductivity (p.64).\n\n### Communicate with workers rather than executives\nSpend your time on the shop floor listening to the suggestions of floor workers to find problems to solve and get information regarding limits your company can go beyond, one way to implement this is by performing skip-level meetings so workers can bypass direct supervisors and have their ideas heard (p.157, 286, 328). Be willing to treat people politely and respectfully, as not treating them well may make them disinclined to tell you where the problems are (p.166).\n\n### Draw clear lines for segregation of duties\nBe clear to employees that duties precede relationships. For example, if you are trying to drive down costs, ensure your financial analysts understand they are not to befriend the engineers who set the costs, because the analysts need to serve as objective judges of the engineers (p.363). Enforce internal transparency and integrity by proactively asking and investigating staff so that you can find conflicts of interest that are being hidden because there is no incentive for those conflicts which threaten your operations to out themselves (p.571).\n\n### Proactively fight against analysis paralysis\nLeaders need to step in when analysis paralysis is happening, to make decisions that will move efforts forward fast by trying, failing, then fixing, instead of spending months on analysis prior to taking action (p.388).\n\n\n\n## TEAM DYNAMICS\n\n### Hire team members based on attitude over skills and experience\n\"When hiring, look for people with the right attitude. Skills can be taught. Attitude changes require a brain transplant\" (p.286). Prioritise candidates who have an attitude to work maniacally hard, but be wary of anyone whose confidence is greater than their competence (p.350, 512). If you want to have a hardcore, fanatic work culture, you need to have a staffing method that cuts to the bone (p.522).\n\n### Encourage team members to prioritise their feedback loops over comradery\nIt is inevitable that employees will need a good feedback loop and have the initiative to seek criticism from others to improve (p.365). Comradery can be dangerous because it makes it hard for people to challenge each other's work, creating a counterproductive tendency to avoid throwing colleagues under the bus, but that tendency needs to be avoided for improvement to begin (p.285).\n\n### Prepare the team to support a leader who is steering off the rails\nNo one is perfect, and even a leader can make severely bad decisions out of impulsive emotion. To handle this, have a team member inform them as such and have other team members raise it with them to show consensus. Then ensure the team quietly knows to avoid carrying out reactionary orders from that leader until the storm of emotion passes and when that leader is able to properly process the inputs (p.539).\n\n\n\n## PRODUCT DEVELOPMENT\n\n### Innovate by setting metrics as your goal post\nInnovative business ideas come from translating the inefficiencies of existing technologies as clear metrics, like the time take to manually type information into a computer or the cost per pound to get a payload into orbit, then working hard to improve that metric's value by advancing its underlying technology (p.93, 355, 399). The metric's value can be displayed on a large monitor, so the team can treat it like a game to try to improve it, making it also a measure for product engineering performance (p.596).\n\n### Initial product brainstorming\nFirst think of the materials used to build your product including the reasonings for those materials and the product's structure, then have the team members create a detailed chart of any functionality they want and the cost of manufacturing each at scale (p.316, 486).\n\n### Co-locate engineers with designers\nHave designers and engineers work together in the same room so they can have a \"throw-it-over-the-fence\" mentality such they think like the other, because true industrial design connects the beauty of a product to its engineering (p.79, 137, 200). Separating product design from engineering is a recipe for dysfunction, so ensure you have set things up such that designers feel immediate pain if something they devised is hard to engineer. For this reason, engineers should lead the design process rather than product managers (p.79).\n\n\n\n## MANUFACTURING\n\n### Empower assembly line teams using factory layout\nWhen designing a factory, make the layout so that an assembly line person can collar a designer or engineer and hold them accountable to bad designs (p.109). This can be achieved by placing the cubicles for the engineers beside the assembly lines, so they can see when something goes wrong and hear complaints if their design causes a slowdown (p.219). Make it a collective responsibility by corralling the engineers to frequently walk up and down the assembly lines with you to assess the production line's efficiency, so if they find an aspect of product design is expensive to produce, it'll require changing the design (p.219, 390).\n\n### Inhouse your supply chain and minimise dependencies\nAlthough outsourcing may be cheaper, a poor international supply chain can be a logistical nightmare and can cause cash-flow problems (p.160). Key components should be made inhouse to control quality, costs, and supply chain, whilst aiming for vertical integration (p.132). In-housing can be further improved by pursuing good manufacturing process inspirations, like the cold casting mould method used for toy cars which removes the need to piece together hundreds of parts (p.338). You can also cleverly get 24 hours of production with 16 hours of human labour using machines and careful prediction of when human intervention would be necessary, which helps get around labour laws whilst maximising production time (p.158-159).\n\n### Challenge costs\nChallenge your suppliers on costs they charge on components, especially if there are equivalent cheaper components in other industries, or consider making it in-house at a fraction of the price (p.112). \n\n### Pursue efficiency via the \"Idiot Index\" and \"The algorithm\"\nThe **idiot index** identifies the economically problematic components in the production process, and **the algorithm** is a methodology to improve the production process itself.\n\nThe **idiot index** is \"...the ratio of the total cost of a component to the cost of its raw materials. Something with a high idiot index--say a component that cost $1,000 when the aluminium that composed it only cost $100--was likely to have a design that was too complex or a manufacturing process that was too inefficient...If the ratio is high, you're an idiot\" for not addressing it (p.363).\n\n**\"The algorithm\"** is a 5-point checklist (p.284-285):\n1. \"Question every requirement. Each should come with the name of the person who made it. You should never accept that a requirement came from a department... Then you should question it, no matter how smart that person is...Then make the requirements less dumb\".\n2. \"Delete any part or process you can. You may have to add them back later. In fact, if you do not end up adding back at least 10% of them, then you didn't delete enough\".\n3. \"Simplify and optimize. This should come after step two. A common mistake is to simplify and optimize a part or a process that should not exist\".\n4. \"Accelerate cycle time. Every process can be [ sped ] up. But only do this after you have followed the first three steps\", it is a mistake to automate first because some time accelerating processes may need to be removed altogether.\n5. Automate. This comes last in designing the production process. Wait until all requirements have been questioned, and all unnecessary parts and processes deleted.\n\n\n\n## NEGOTIATION\n\n### Stay calm against disruptive opening offers\nDuring a business negotiation, if your counterpart is exaggerating numbers and making an offer that would be considered illogical, be patient and consider the possibility that it is just their opening move, before walking away from the table entirely. Some people just like to play games (p.77).\n\n### Convince with tangible actions, not with words alone\nIf you have a potential partner hesitant to join forces with yours, one strategy is to physically demonstrate at a very large scale, that your side is willing to plough ahead with your endeavour even without the potential partner, like the building of a for-purpose factory (p.221).\n\n### Do due diligence for acquisitions\nWhen making a deal to buy out a company, make it contingent on full due diligence to minimise the trouble it would otherwise cause later (p.463).\n\n### Pursue outcomes and merit-based work\nCost-plus contracts are where you are paid for your costs plus guaranteed profit, which is ineffective as it is an incentive to never finish work. If such a system is in place, challenge it with outcomes-based fixed pricing where companies should be risking their own capital (p.123). \n\n\n\n## 3 OTHER USEFUL NOTES\n\n1. First principles thinking involves \"...drilling down to the basic physics of the situation and building up from there\" (p.99). Approach your problems using this mindset.\n\n2. One way to show you are listening in meetings, is to parrot back what others are saying as confirmation you've understood what they have said (p.368). This is similar to an approach mentioned in Jordan Peterson's \"12 Rules of Life\", where you need to accurately summarise a person's ideas as you understand them, before conveying your own points.\n\n3. Here is a list of authors and books mentioned as having been read by the biographee:\n\n```\nAuthors:\n* Martin Heidegger\n* Friedrich Nietzsche\n* Arthur Schopenhauer\n\nBooks:\n* Douglas Adams\n  │── \"Hitchhiker's Guide to the Galaxy\" (1979, sci-fi)\n* Isaac Asimov\n  │── \"Robots and Empire\" (1985, sci-fi)\n  │── \"Foundation\" series (1951-1993, sci-fi)\n* Iain Banks\n  │── \"Culture\" series (1987-2012, sci-fi)\n* Clayton Christensen\n  │── \"The Innovator's Dilemma\" (1997, business)\n* Winston Churchill\n  │── \"The Second World War\" (1948-1953, history)\n* Robert Heinlein\n  │── \"The Moon Is a Harsh Mistress\" (1966, sci-fi)\n* The Onion\n  │── \"Our Dumb Century\" (1999, satire)\n\nMagazines:\n* Amazing Stories magazine (1926-1939, sci-fi)\n```\n\n\n\nThis book is an excellent testament to how belief in humanity, curiosity, intelligence, sheer force of will, luck, and karma can overcome near-impossible odds and make an at-scale tangible difference. It also shows the depth of sacrifice and toll it takes to pursue such a path.\n\nThe biographee envisions humanity being more technologically advanced than now to achieve species-level self-determination in the universe. His success in making tangible steps toward this explains why his efforts are often widely acclaimed.\n\nAfter reading it, this book may provoke your dormant nihilism, an existential crisis of self-comparison, or inspiration for positive change--so choose wisely. Personally, I'll opt for the hopeful outlook.\n\n\n\n### Reference\n\n* **[Elon Musk by Walter Isaacson (2023)](https://www.simonandschuster.com.au/books/Elon-Musk/Walter-Isaacson/9781761427978)**\n\n\n\nClick **[here](https://github.com/makuharistudio/makuharistudio.github.io/blob/main/src/markdown/readings/2025-04-20.md)** for this reading page's markdown file in GitHub."
  },
  {
    "id": 1742043600,
    "title": "12 Rules for Life",
    "name": "12-rules-for-life",
    "author": "Jordan B. Peterson",
    "publisher": "Penguin Random House UK",
    "publisherURL": "https://www.penguin.co.uk/books/309610/12-rules-for-life-by-peterson-jordan-b/9780141988511",
    "photo": "../assets/readings/12-rules-for-life-by-jordan-b-peterson.png",
    "category": "personal development",
    "date": "16 March 2025",
    "desc": "A philosophical guide on foundational approaches to help live a better life supported with anecdotes from the author's personal life and clinical practice, science, religion, and fiction.",
    "tags": "[\"Personal development\", \"Philosophy\"]",
    "content": "\n![12 Rules for Life by Jordan B. Peterson](/src/assets/readings/12-rules-for-life-by-jordan-b-peterson.png)\n\n\n\nThis book was name-dropped in the author's YouTube lectures and interviews, so I bought a copy to try it. It is the first non-technical book I have read since university, so it was not an easy transition to go from my preferred reading of factual and \"to-the-point\" near-discussionless information, to wading through such philosophical and life-oriented lessons.\n\nAdmittedly, I nearly dropped the book early on when it discussed the difference between light and darkness, as I felt it lingered too much on that point. I powered through that and was rewarded with interesting anecdotes from the author's life and clinical practice. The most memorable example for me is when the author and his wife looked after a neighbour's neglected child.\n\nA part of me wished I had the knowledge from this book at an earlier age in life, but I do wonder if youthful impatience would have prevented me from properly incorporating those lessons.\n\nThese rules (or variations of them) I had already been aware of and tried living by before finding this book:\n\n* Rule 1: Have good posture.\n* Rule 4: Don't compare yourself to others. \n* Rule 6: Fix yourself instead of blaming others.\n* Rule 7: Choose the actions that will improve your tomorrow instead of indulging in today's pleasure.\n* Rule 8: Avoid lying.\n* Rule 9: You don't know everything so try genuinely listening to others.\n* Rule 11: Let yourself and others test their limits and be challenged.\n* Rule 12: Enjoy the few miraculous and wondrous moments that life gives you.\n\nThese were the lessons that were new for me:\n\n* Rule 2: Build the attitude to want to help yourself get a better life, regardless of any self-contempt or self-criticisms you have.\n* Rule 3: Surround yourself with people who genuinely strive for their own self-improvement, and expect your relationships with them to not be easy. It is better than having a supposedly easy relationship with someone who sees your self-improvement efforts as a fault.\n* Rule 5: Discourage behaviours in the people close to you which may lead them to becom a social disgrace or being mentally immature.\n* Rule 10: Communicate your feelings in order to confront those feelings and what you intend. Even when your efforts to be precise don't solve the problem, at least you will remove the ambiguity which is far worse than the problem.\n\nBasically, the book encourages you to improve your internal locus of control, by setting your mindset and life in a constructive direction. The book does this by repeatedly confronting people corrupted by nihilism who denounce humanity whilst hiding behind a fake guise of being anti-prejudice.\n\nMy favourite quote:\n\n\"Aim up. Pay attention. Fix what you can fix. Don't be arrogant in your knowledge. Strive for humility, because totalitarian pride manifests itself in intolerance, oppression, torture and death. Become aware of your own insufficiency--your cowardice, malevolence, resentment and hatred. Consider the murderousness of your own spirit before you dare accuse others, and before you attempt to repair the fabric of the world\" (p.198).\n\nThe book has a number of other wisdoms, but I'll list only 3 of my other favourites below. The rest you can read the book to discover.\n\n1. You need to reveal yourself to the world for the best possible version of you to be brought forth into the world (p.212).\n2. Make your ambitions based on the building of your character and ability because those will always be with you regardless of status and power which can easily be lost (p.224).\n3. Deliberately say the things and go to the places that put you into the new situations needed for you to be switched on and placed on the path to be more complete as an individual (p.212).\n\nIn summary, the book may be a difficult read for the philosophically uninitiated, but the lessons are good. Truthfully, I prefer to listen to the author's lectures and interviews. They cover less ground, but feel more concise and have stronger impact in video format.\n\n\n\n### Reference\n\n* **[12 Rules for Life by Jordan B. Peterson (2018)](https://www.penguin.co.uk/books/309610/12-rules-for-life-by-peterson-jordan-b/9780141988511)**\n\n\n\nClick **[here](https://github.com/makuharistudio/makuharistudio.github.io/blob/main/src/markdown/readings/2025-03-16.md)** for this reading page's markdown file in GitHub."
  }
]