[
  {
    "id": 1745071200,
    "title": "Elon Musk\r",
    "name": "elon-musk",
    "author": "Walter Isaacson\r",
    "publisher": "Simon & Schuster\r",
    "publisherURL": "https://www.simonandschuster.com.au/books/Elon-Musk/Walter-Isaacson/9781761427978\r",
    "photo": "../assets/readings/elon-musk-by-walter-isaacson.png\r",
    "category": "biography\r",
    "date": "20 April 2025\r",
    "desc": "A chronicle of Elon Musk's journey from a difficult childhood to his successive founding of multiple industry-redefining companies up until the early establishing of X.AI in 2023.\r",
    "tags": "[\"Biography\", \"Technology\", \"Business\"]\r",
    "content": "![Elon Musk by Walter Isaacson](../assets/readings/elon-musk-by-walter-isaacson.png)\r\n\r\n\r\nThis book chronicles the biographee's life from a challenging childhood to the founding of multiple companies that revolutionised key technology industries.\r\n\r\nGiven the plethora of lessons, this post does not attempt to summarise the categories they relate to, e.g. leadership, team dynamics, communication, etc. as that would add unnecessary fluff.\r\n\r\nSo instead, I list in bullet points the business-relevant lessons from the book for my ease of reference and potential personal application.\r\n\r\nFor transparency, I used Grok to initially group and order the points I noted, though I ultimately combed through them and reorganised quite a bit.\r\n\r\nThe nature of this listing takes away the roller coaster ride of anecdotes that colour this book and its lessons. I recommend reading the biography first, and to just use this list as a general reference.\r\n\r\nThis book includes many other types of lessons covering morality, integrity, relationships, politics, and more, but those won't be covered here. The anecdotes which the lessons derive from won't be covered either. Again, please read the book for that information.\r\n\r\n\r\n## PERSONAL MINDSET\r\n\r\n### Define who you are\r\n• Even if you really enjoy doing something, be clear whether or not that something really is the best way to spend your life. Is there something else you want to do which will have more impact? (p.56).\r\n\r\n• Be clear with yourself as soon as you can, as to whether or not you are okay with working for other people (p.48), or if you prefer to be the one having people work for you so you can commit to your preferred approach.\r\n\r\n• One tactic to validate your mental state is to talk about yourself on a long-form platform like a podcast (p.297).\r\n\r\n### Live by learning through risk-taking\r\n• Do not let your decisions be guided by fear (p.25).\r\n\r\n• Learn to view risk as a type of fuel rather than as something to avoid (p.252).\r\n\r\n• When you are at a crossroads and one of the options is a once-in-a-lifetime opportunity, shoot for that opportunity. But if there's a way to create a fallback plan despite the unlikelihood of your future self needing to use it, you should set that up too (p.58-59).\r\n\r\n• Even when your attempts at risk-taking fail, do your best to make every bad situation salvageable (p.116).\r\n\r\n• You can either use the wealth you earn for short-term pleasure which doesn't really achieve anything, or you can choose to invest it all back into the game of life and business again (p.67).\r\n\r\n• Conventional entrepreneurs are not risk takers, they are risk mitigators, constantly figuring out the controllable variables to minimise their risk (p.86).\r\n\r\n### Problem-solving\r\n• \"It's OK to be wrong. Just don't be confident and wrong\" (p.286).\r\n\r\n• Take an iterative approach and learn by failing, with the attitude of quickly getting back up by identifying problems so you can fix them (p.114).\r\n\r\n• Know when to step back to reframe a problem, especially when you're getting mad about it. For example, rather than changing some aspect of your product, perhaps you may be able to change the context it is in (p.99 & 247).\r\n\r\n###\t\"Polytopia life lessons\"\r\nPolytopia is a video game that the biographee recommended to his brother on learning how to be a CEO.\r\n\r\n1.\t\"Empathy is not an asset\", it will hurt you in business (p.426).\r\n2.\t\"Play life like a game\" (p.426).\r\n3.\t\"Do not fear losing\", it is inevitable and will happen many times. Get used to losing so you play each subsequent game with less emotion, become more fearless, and take more risks (p.426).\r\n4.\t\"Be proactive\", you can never win unless you take charge of setting the strategy (p.426-427).\r\n5.\t\"Optimize every turn...you only get a set number of turns in life\" so do not let them slide (p.427).\r\n6.\t\"Double down\", put everything back into the game to grow (p.427).\r\n7.\t\"Pick your battles\", if you try to attack at everything that surrounds you, you will lose all your resources. Use front minimisation tactics (p.427).\r\n8.\t\"Unplug at times\", remove distractions because they waste brain cycles (p.427).\r\n\r\n\r\n\r\n## STRATEGY AND VISION\r\n\r\n### Business Mission\r\n• When your company mission is important enough, optimism and pessimism are irrelevant. All that matters is taking the steps forward to achieve the mission (p.177). \r\n\r\n• You can either be in the business of making niche products, or remaking entire industries (p.79). \r\n\r\n• A road less taken is to start with the mission, then work backward to figure out how to make it work financially (p.93).\r\n\r\n• One option is to come up with a business concept that helps avoid the commonly made mistake of many corporate leaders when defining their business. Such as by defining your company as a type of innovation company (p.253-254). This is also advantageous in case of any future acquisitions or mergers, in that the merger will be less challenged if it falls in line with that core innovation mission (p.255).\r\n\r\n### Opportunities\r\n• Do not let incumbent industry mindset inhibit you from seeing opportunities in that industry (p.48). \r\n\r\n• Before entering an industry that isn't doing well in terms of product sales, figure out the reasons why it isn't doing well, and simplify the process for the customer by taking on the legwork to fix those problems (p.252).\r\n\r\n• Be open to other business models as a way to side-fund your main model. For example, if part of your supply chain creates a component needed by another business, consider selling that component to that other business (p.193).\r\n\r\n• Endeavours that are seemingly independent might be able to be tied together into a new one (p.244). \r\n\r\n• The data your company collects can be a gold mine if you are able to use it for something other than its originally intended purpose (p.243). \r\n\r\n• Having an \"...online payment system would have the added benefit of authenticating users\" (p.456).\r\n\r\n• Be willing to sell your first company when the time is right, so you can move on to build your next ones (p.65). \r\n\r\n### Organisational Attitude\r\n• A \"maniacal sense of urgency\" is needed as an operating principle for companies to avoid being flabby and slow (p.286 & 349), because complacency can be a scourge to business (p.508). \r\n\r\n• If your company is too conservative and long-lived, it may be good to accept that you need to change, and adopt entrepreneurial efforts (p.222).\r\n\r\n### Mergers and Acquisitions\r\n• If there are two competing companies whose clash will result in only one or the other surviving, it may make sense to merge them instead (p.76). \r\n\r\n• If you want to genuinely fix a company, you cannot effectively do so as a mere shareholder. You would need to take it private then fix it to prevent distractions that would otherwise interfere or slow down the fix effort (p.452). \r\n\r\n• When making a deal to buy out a company, make it contingent on full due diligence to minimise the trouble it would otherwise cause later (p.463).\r\n\r\n• When you acquire a software company, you can create a team to \"...forman analysis unit that would assess the code-writing skills, productivity, and even the attitudes\" of engineering staff (p.518).\r\n\r\nPotential methodology for software company staff-cutting:\r\n\r\n  *  Search to see who has done a hundred lines of code or more in the last month and see who has been committing code (p.518), and make software engineers send samples of code they have recently written (p.556).\r\n\r\n  *  Begin with those who have the highest level to the software stack (p.549).\r\n\r\n  *  After finding those did a non-trivial amount of coding, from that group find the ones who did the best coding (p.518).\r\n\r\n  *  Other than just singling out strong individuals, it is important to find teams that work well together, because team accomplishments can be greater than what a single person does (p.519).\r\n\r\n  *  One tactic is that if you lay off staff before the date bonuses and options are due, then you don't have to pay them. However, that may trigger breach of contract and employment law violations which may cost you more than simply waiting after the contracted bonuses are distributed (p.522).\r\n\r\n  *  Check Slack messages and social media postings of employees to see who may be disloyal, disgruntled, or a threat (p.549).\r\n\r\n  *  Give people the option to opt-in to the company after acquisition with a company-wide email outlining the work expectations after the acquisition, and the option to opt-out with severance (p.550).\r\n\r\n### Market Strategy\r\n• One market strategy is making your product a platform for incumbent industry leaders (p.63), but that would relegate your company to the status of \"an unbranded vendor\" for that industry (p.65). \r\n\r\n• \"True product people have a compulsion to sell directly to consumers, without middlemen muddying things up\" (p.65). \r\n\r\n• For high-cost industries, the strategy would be to create a high-price and quality iteration first, before designing a mass-market model (p.127). \r\n\r\n• Be a product company, not a sales company. The philosophy is that if you make a great product, the sales would follow, so there shouldn't be as much need to put much effort into sales and marketing (p.253). \r\n\r\n• If your company mission has wide social impact, one strategy you can come up with for problem-solving, is to hold an international design competition for students, as it additionally provides you information on potentially great candidates to employ (p.258).\r\n\r\n### External Relationships and Contracts\r\n• \"Great things will never happen with VCs or professional managers...They don't have the creativity or the insight\" -- cited from Inc. Magazine (p.65). \r\n\r\n• If your company is competing against other vendors and the contractor is using a no-bid contract to prop up a competitor, consider suing if it seems wrong and corrupt (p.122). \r\n\r\n• Cost-plus contracts are where you are paid for your costs plus guaranteed profit, which is ineffective as it is an incentive to never finish work. If such a system is in place, challenge it with outcomes-based fixed pricing where companies should be risking their own capital (p.123). \r\n\r\n\r\n\r\n## LEADERSHIP\r\n\r\n### Product Leadership\r\n• Even if you do not want to be CEO, you will need to be if you truly want to be the chief technology or product officer (p.63).\r\n\r\n• Take the kind of initiative where if you're raising public awareness of your company, that you push to have the product or prototype ready for display to the public (p.121 & 194).\r\n\r\n• Focus on a key metric for your business, like the cost per pound to get a payload into orbit (p.101).\r\n\r\n### Roles and Responsibilities\r\n• Be clear about roles in relation to contributions. A combination of inspiration, perspiration, and risk is needed to be regarded as a legitimate cofounder (p.109). \r\n\r\n• An issue with startups is with who should be in charge, but it should be made clear initially, though the one with most equity typically has ultimate authority (p.134).\r\n\r\n• Delegate roles and responsibilities if you do not have the time to do everything (p.188).\r\n\r\n• When there needs to be clear segregation of duties and relationships, make it clear to the employees. For example, if you are trying to drive down costs, ensure your financial analysts understand they are not to befriend the engineers who set the costs, because the analysts need to serve as judges of the engineers (p.363). \r\n\r\n• Internal transparency and integrity are important. If there is a conflict of interest, the person in question has little incentive to reveal it, so it takes proactive asking and investigating staff to confirm and remove people who are in such positions (p.571).\r\n\r\n### General Leadership\r\n• As a leader of a team, it is not your job to make people love you, as that can lead to counterproductivity (p.64).\r\n\r\n• As an effective leader, it is important you are able to be brought around by evidence, even if it goes against your perception on the issue (p.407).\r\n\r\n• Be the kind of leader that takes in the risk information and data from your team, make a quick assessment, and shift responsibility from them to yourself (p.210).\r\n\r\n• A good leader takes responsibility for their mistake, even if it is done publicly (p.282).\r\n\r\n• Like how a general is on a battlefield to motivate the troops, a leader should be on the factory floor with the workers (p.480). \r\n\r\n• \"Never ask your troops to do something you're not willing to do\" (p.286). \r\n\r\n• \"All technical managers must have hands-on experience. For example, managers of software teams must spend at least 20% of their time coding. Solar roof managers must spend time on the roofs doing installations. Otherwise, they are like a cavalry leader who can't ride a horse or a general who can't use a sword\" (p.285).\r\n\r\n• After a massive mission-critical failure, it's a good idea to make the next attempt a tight but do-able timeframe to re-energise your team as a demonstration of your will to not give up (p.184).\r\n\r\n• Even if 20 of your 100 command decisions are going to be wrong, they can be amended later. The urgency of making decisions fast and hard in order to prevent a company's death is important (p.279).\r\n\r\n### Communication\r\n• When you invest in a company, you should spend your time on the shop floor and listen to the suggestions of the floor workers (p.157). \r\n\r\n• Rather than talking with company executives, speak with workers to get information regarding limits you can go beyond (p.328). \r\n\r\n• \"Whenever there are problems to solve, don't just meet with your managers\" perform skip-level meetings so that employees can bypass their direct supervisors and have their ideas heard (p.286). \r\n\r\n• It's important as a leader to have at least someone who can tell you the truth you can act upon without wanting to fire that said someone (p.329).\r\n\r\n• To support your leader when they are making a bad decision out of emotion, inform them as such and have others raise it with them to show consensus. Then avoid carrying out reactionary orders from that leader until the storm of emotion passes, and they are able to properly process the inputs (p.539).\r\n\r\n• Treat people politely and respectfully, as not treating them well may make them disinclined to tell you where problems that need to be fixed are (p.166).\r\n\r\n• One way to show you are listening in meetings, is to parrot back what others are saying (p.368).\r\n\r\n• When discussing the critical future strategy for a company, it is best to keep phones away, as they could be otherwise used to monitor the conversation (p.604).\r\n\r\n\r\n\r\n## TEAM DYNAMICS\r\n\r\n### Development\r\n• When your company is hosting an event that doubles as a recruiting drive, it is not a good idea to use very technical slides for the main presentation (p.396).\r\n\r\n• \"When hiring, look for people with the right attitude. Skills can be taught. Attitude changes require a brain transplant\" (p.286).\r\n\r\n• Prioritise an attitude to work maniacally hard over skills listed on a resume (p.350).\r\n\r\n• Be wary of anyone whose confidence is greater than their competence (p.512).\r\n\r\n• If you want to have a hardcore, fanatic work culture, you need to have a staffing method that cuts to the bone (p.522).\r\n\r\n• If you're wanting to start a company that will require highly specialised talent, it's best to physically start the company where that talent is geographically congregated (p.95).\r\n\r\n• Be careful of working in environments that reduce your probability of success, but if you have no choice, then frame it as a challenge that forges and bonds your team together (p.147).\r\n\r\n• When an intern goes above and beyond, be sure to give them an immediate reward (p.148).\r\n\r\n• Do not assign blame until you have found physical evidence for the cause of an issue (p.152).\r\n\r\n### Independent members\r\n• As an employee, it's important to be proactive, if you can foresee an issue that can crop up and you can take responsibility for it, do so before it becomes a problem even without asking permission (p.526).\r\n\r\n• By trying to be nice to members who've made mistakes, you're conversely being not nice to the others who are doing their jobs well (p.273).\r\n\r\n• Comradery can be dangerous because it makes it hard for people to challenge each other's work. There is a tendency to not want to throw a colleague under the bus, and that rendency needs to be avoided (p.285).\r\n\r\n• When you receive critical or hardcore feedback, you will need a good feedback loop and be able to actively seek criticism from others and improve (p.365).\r\n\r\n• It is good to have employees who are willing to keep projects alive quietly as shadow projects, in case those projects are needed later (p.502).\r\n\r\n• If your manager is trying to move you to a completely different team but you are wanting to stay in your current role because you are working on a project that has greater impact, show your manager the benefits of that project to convince them (p.593-594).\r\n\r\n### Being present\r\n• There is value in showing up to work in person, it offers opportunities you wouldn't have gotten working from home (p.519).\r\n\r\n• Being together at the office facilitates the flow of ideas and energy (p.541).\r\n\r\n### Operational Efficiency\r\n• Setting unrealistic deadlines and aggressive schedules can make a company achieve things that others do not, but setting physically impossible ones can be demoralising for staff. Though you may miss schedules and cost targets, you at least will beat your competition (p.114).\r\n\r\n• When your company is projected to run out of cash within weeks, call in a SWAT team. It's not the product that leads a company to success, it's the ability to make it cost efficient, i.e. it's how you design the factory (p.156).\r\n\r\n• Leaders need to step in when analysis paralysis is happening, to make decisions that will move efforts forward fast by trying, failing, then fixing, instead of spending months on analysis (p.388). \r\n\r\n• \"phoning in rich\" is a concept where people have been in a company for a long time, and because they have enough money and vacation homes, they no longer have the drive to stay all night on the factory floor to get things moving (p.302).\r\n\r\n\r\n\r\n## PRODUCT DEVELOPMENT\r\n\r\n### Innovation\r\n• First principles thinking involves \"...drilling down to the basic physics of the situation and building up from there\" (p.99). \r\n\r\n• Technology does not automatically improve. It only improves if people work hard to make it better (p.93). \r\n\r\n• Innovative business ideas can come from finding the inefficiencies of existing technologies, like the time take to manually type information into a computer (p.399).\r\n\r\n• \"Some of the best innovations come from combining two previous innovations\" (p.61). \r\n\r\n• Innovation is driven by setting clear metrics, like how many photons are collected by a satellite versus how many it shoots back to Earth (p.355).\r\n\r\n• \"The only rules are the ones dictated by the laws of physics. Everything else is a recommendation\" (p.286).\r\n\r\n• \"If conventional thinking makes your mission impossible ... then unconventional thinking is necessary (p.283).\r\n\r\n• If you are using a neural network to solve a problem and want to convince someone it is superior to a conventional programmed rules-based method, show the instances where the performance is better (p.595).\r\n\r\n### Problem-Solving\r\n• If your company doesn't know how to solve a problem, then try to gain a deep understanding of the issue and follow up by asking experts (p.55).\r\n\r\n• Understand the fundamental nature of the problem your company is trying to solve, what seems to be the main problem may just be a layer on top of another underlying problem that the product needs to address (p.250).\r\n\r\n### Design\r\n• For brainstorming a product, think of the materials that should be used to build it first, the reasonings to use those materials, and the product's structure, as the starting point for the product's visual design (p.316).\r\n\r\n• Separating the design of a product from its engineering is a recipe for dysfunction. Designers have to feel the immediate pain if something they devised is hard to engineer. For this reason, engineers rather than the product managers should lead the team in the design process (p.79). \r\n\r\n• Have designers and engineers work together in the same room so they can have a \"throw-it-over-the-fence\" mentality such that designers think like engineers, and engineers who think like designers, because \"...true industrial design must connect the looks of a product to its engineering\" (p.200). \r\n\r\n• Be hardcore about making the product actually beautiful (p.137).\r\n\r\n• When first developing a product, one approach can be to have the team members create a detailed chart of any functionality they want and the cost of manufacturing it at scale (p.486). \r\n\r\n• Having a good design-manufacturing feedback loop gives a competitive advantage because it allows daily innovation (p.218). \r\n\r\n• When you are developing a vision for your product or enhancing it, you can try projecting your revenue for potential new features (p.456).\r\n\r\n• If you're building a software product, design it with the aim to do things with the least number of keystrokes (p.76).\r\n\r\n### Launch\r\n• You only get to first release your product once, so make it something that wows customers (p.135).\r\n\r\n• An important element when launching a new product is creating a buzz that transforms it into an object of desire (p.140). \r\n\r\n### Market Perception\r\n• When your product has the potential to cause fatalities, there is a logical stance that the product should be viewed that overall it leads to less accidents, versus the emotional stance that the nature of the product's capacity for fatality being inherently provocative. You'll need to be mindful of the marketing around these views (p.248). \r\n\r\n• Uploading a milestone in progress of your product's development to YouTube can be good for marketing (p.403).\r\n\r\n• Be mindful that you are not providing services to customers whose use of your product may negatively impact your company's reputation significantly (p.386).\r\n\r\n\r\n\r\n## MANUFACTURING\r\n\r\n### Resource Management\r\n• When rebuilding an area, try scavenging for components that could be cheaply repurposed (p.205). \r\n\r\n• Although outsourcing may be cheaper, a poor international supply chain can be a logistical nightmare and cause cash-flow problems (p.160).\r\n\r\n### Cost Optimization\r\n• Challenge your suppliers on costs charged on components, especially if there are equivalent components in other industries that go for cheaper. If they are still charging it too high, look to make it in-house at a fraction of their price (p.112). \r\n\r\n• Do not allow someone who is not being real about the numbers or actual costs (e.g. not having a bill of materials) to continue their current methodology (p.161).\r\n\r\n### Production Design and Layout\r\n• When designing a factory, make the layout so that an assembly line person can collar a designer or engineer and hold them accountable to bad designs (p.109). This can be achieved by placing the cubicles for the engineers beside the assembly lines, so they can see when something goes wrong and hear complaints if their design causes a slowdown (p.219).\r\n\r\n• Do not separate the design and production groups. Make the designer responsible for the production process, that way if the design is expensive to produce, it'll require changing the design (p.390).\r\n\r\n• \"...designing a good factory [ is ] like designing a microchip. It [ is ] important to create, in each patch, the right density, flow, and processes...[ Setup ] each station on the assembly line with a green or red light indicate whether it [ is ] flowing properly\" (p.278). \r\n\r\n• Coral the engineers to walk up and the down the assembly lines with you to assess the production line's efficiency (p.219).\r\n\r\n• Sometimes military history can provide insight into strategies that can help commercial, such as building production lines in your factory's parking lot when trying to meet a critical quota (p.282).\r\n\r\n• If you are using a metric to measure your product engineering performance, they can treat it like a game by setting the current metric value on a large monitor (p.596).\r\n\r\n### Production Efficiency\r\n• Key components should be made inhouse to control quality, costs, and supply chain, whilst aiming for vertical integration (p.132).\r\n\r\n• You can cleverly get 24 hours of production with 16 hours of human labour using machines and careful prediction of when human intervention would be necessary, to get around a country's labour laws around maximum work hours per day (p.158-159).\r\n\r\n• There are good manufacturing process inspirations from toys, like using a cold casting mould method, rather than piecing together hundreds of pieces for the same output (p.338).\r\n\r\n• A high-level indicator if your company is inefficient is to compare the staff numbers used to perform equivalent task between companies (p.463).\r\n\r\n• Be cautious of underestimating the complexity of what you are building and do not to over-automate (p.57). \r\n\r\n### \"Idiot Index\" and \"The algorithm\" i.e. Efficiency Improvement\r\n\r\nThe **idiot index** is used to identify the priority components in the production process that need to be addressed, and **the algorithm** is a methodology to improve the production process.\r\n\r\n• The **idiot index** is \"...the ratio of the total cost of a component to the cost of its raw materials. Something with a high idiot index--say a component that cost $1,000 when the aluminum that composed it only cost $100--was likely to have a design that was too complex or a manufacturing process that was too inefficient...If the ratio is high, you're an idiot\" (p.363).\r\n\r\n• **\"The algorithm\"** is a 5-point checklist\r\n\r\n  1. \"Question every requirement. Each should come with the name of the person who made it. You should never accept that a requirement came from a department...You need to know the name of the real person who made that requirement. Then you should question it, no matter how smart that person is. Requirements from smart people are the most dangerous, because people are less likely to question them...Then make the requirements less dumb\" (p.284-285).\r\n\r\n  2. \"Delete any part or process you can. You may have to add them back later. In fact, if you do not end up adding back at least 10% of them, then you didn't delete enough\" (p.285).\r\n\r\n  3. \"Simplify and optimize. This should come after step two. A common mistake is to simplify and optimize a part or a process that should not exist\" (p.285).\r\n\r\n  4. \"Accelerate cycle time. Every process can be [ sped ] up. But only do this after you have followed the first three steps\", it is a mistake to automate first, because some time accelerating processes may need to be removed altogether (p.285).\r\n\r\n  5. Automate. This comes last in designing the production process, wait until all requirements have been questioned, and all unnecessary parts and processes deleted and bugs removed (p.274 & 285).\r\n\r\n### Automation and Technology\r\n• It is not a correct approach to attempt to automate absolutely everything in a production line, as this will result in you having to find the parts of that process that don't work to de-automate and replace with people for more efficiency (p.274).\r\n\r\n• Production lines can halt when a safety sensor is triggered, especially if they are over-sensitive, so it is worth testing them and removing them if they are not critical (p.280). \r\n\r\n• Factory settings on the control console for robotic arms can be poorly configured for your manufacturing task, so check it and reconfigure as needed for top efficiency (p.280). \r\n\r\n• There are some tasks that humans do better than robots, so perils may come with pursuing automation too relentlessly (p.281).\r\n\r\n• Before you take down a data centre, ensure there are no hard-coded references to that data centre (p.590).\r\n\r\n\r\n\r\n## LEGAL AND ETHICAL CONSIDERATIONS\r\n• If someone tries to patent a crucial component or workflow for your company, double-check to see if it is something that has been discussed historically, and consider suing to stop the patent (p.228).\r\n\r\n• Avoid allowing your product or service to be used as a potential trigger mechanism for a nuclear war (p.431-432).\r\n\r\n• Do not engage with the endeavours of those who are short-selling your company's stock (p.438).\r\n\r\n• An audacious tactic when taking over a company: There is a dual trigger mechanism, delisting of the stock and the change of control, which are required for stakeholders to collect severance and vest their stock options. With careful timing, you could fire the holders of the stock options (e.g. executives) \"for cause\" before their stock options can vest (p.512) by sending letters of dismissal, cut off their email, and exit them from the building, precisely once the money is transferred and necessary documents signed, before they submit their resignations (p.513).\r\n\r\n\r\n\r\n## NEGOTIATION & INVESTMENT\r\n• When trying to impress visiting potential investors, dressing up your equipment to look more than it is, is one strategy to garner interest (p.62).\r\n\r\n• If you have a potential partner (another company) hesitant to join forces with yours, one strategy is to demonstrate at a very large scale, that yours is willing to plough ahead with the endeavour even without them (p.221).\r\n\r\n• During a business negotiation, if your counterpart is exaggerating numbers and making an offer that would be considered logically ridiculous, be patient and consider the possibility that it is just their opening move, before walking away from the table. Some people just like to play games (p.77).\r\n\r\n• If you're getting something at a bargain, don't gloat by telling the seller that (p.78).\r\n\r\n• Even when you struggle and fail to get a company's vision to take the path you want and decide to leave, do so calmy and gracefully. Being civil about it may pay off in the future (p.85).\r\n\r\n• If you end up in a discussion with someone who looks like they're from a movie's mob scene, just walk away (p.79).\r\n\r\n• One way to raise money is hosting a demonstration day showing where you are trying to push the industry forward (p.333).\r\n\r\n• Chinese law requires forming a joint venture with a Chinese company to manufacture there, unless you can find someone who can convince the government that it would be beneficial even without a joint venture (p.313).\r\n\r\n• A strategy that short sellers of a company's stock may use includes insider information and drones that fly over your factory for up-to-date data (p.277). This can also lead to their undoing in the sense they become overly dependent on their predictions using that data (p.278).\r\n\r\n\r\n\r\n## Reflection\r\n\r\nSetting aside the above practical business lessons above, this is the first biography I ever read, and it was difficult for me to make the purchase because I've long carried the preconception that biographies sre uncomfortably intrusive. Like reading some stranger's diary. However, my curiosity to understand how someone like this can possibly exist won me over.\r\n\r\nBefore reading this book, my initial knowledge on the biographee was very superficial as I had only seen a few interview clips on YouTube. After reading this book, I better appreciate how ridiculously rare he is as an individual, and can see why some conspiracy theorists may equate this rarity to him being an extraterrestrial.\r\n\r\nIn all seriousness, he has undergone misfortunes in his life which may be enough to cause other people to give up and take darker or less productive life paths:\r\n\r\n- Born into a country where daily fatal violence in public areas is the norm.\r\n- Physically bullied to near death as a child.\r\n- Psychologically abusive father.\r\n- Single mother who worked multiple jobs to make ends meet.\r\n- Unable to make friends until he started university.\r\n- Passing away of his first-born infant son.\r\n- His political enemies manipulating one of his other children, causing estrangement between them.\r\n- Romantic breakup leading to severe depression and impacting work performance.\r\n- Ongoing neck injury.\r\n- A seemingly chaotic-neutral or chaotic-good alignment that constantly desires being in intense situations.\r\n\r\nYet despite these obstacles and his inherent faults, he still crusades for the practical elevation of humanity as a collective species, even if it costs him in other respects.\r\n\r\nAn excerpt:\r\n\r\n*\"Elon cares a lot about humanity, but humanity in more of a very macro sense...He's willing to just throw his entire being at his mission, and that's what he expects in return...That has a good and bad side. You definitely realize that you're a tool being used to achieve this larger objective, and that's great. But sometimes, tools get worn down and he feels he can just replace the tool...Working for Elon is one of the most exciting things you can do, but it doesn't allow time for a lot else in your life\"* -- cited from Lucas Hughes (p.367).\r\n\r\nHere is a list of authors and books mentioned as having been read by the biographee:\r\n\r\n```\r\nAuthors:\r\n* Martin Heideggar\r\n* Friedrich Nietzsche\r\n* Arthur Schopenhauer\r\n\r\nBooks:\r\n* Douglas Adams\r\n  │── \"Hitchhiker's Guide to the Galaxy\" (1979, sci-fi)\r\n* Isaac Asmiov\r\n  │── \"Robots and Empire\" (1985, sci-fi)\r\n  │── \"Foundation\" series (1951-1993, sci-fi)\r\n* Iain Banks\r\n  │── \"Culture\" series (1987-2012, sci-fi)\r\n* Clayton Christensen\r\n  │── \"The Innovator's Dilemma\" (1997, business)\r\n* Winston Churchill\r\n  │── \"The Second World War\" (1948-1953, history)\r\n* Robert Heinlein\r\n  │── \"The Moon Is a Harsh Mistress\" (1966, sci-fi)\r\n* The Onion\r\n  │── \"Our Dumb Century\" (1999, satire)\r\n\r\nMagazines:\r\n* Amazing Stories magazine (1926-1939, sci-fi)\r\n```\r\n\r\nFrom this biography, I began to wonder if ideals only hold value when manifested through human effort. Some people dream of their own future for humanity but fail to act--perhaps fearing failure or conflict. Does an unacted dream contribute as much tangibly as having no dream at all, i.e. nothing?\r\n\r\nThe biographee envisions humanity being more technologically advanced than now to achieve species-level self-determination in the universe. His success in making tangible steps toward this explains why his contributive efforts are often widely acclaimed.\r\n\r\nI also wonder what defines a life well-lived. This post lists numerous business lessons from the biographee's life. Are we striving to create our own list of unique lessons derived from our actions to tangibly change the world, or merely effortlessly and lazily armchair writing, as I'm doing here? Yes, I am self-aware. Acting meaningfully to create tangible impact takes far greater will and effort than unacted, substanceless ideals. The sheer number of lessons above suggests a well-lived life.\r\n\r\nIn summary, the book is engaging and offers multiple and oftentimes opposing perspectives from involved people. The biographee is very much human with many anecdotes spanning tears to triumphs and painful facepalm moments to comical joy. There are also moments that underscore the author's restrained misgivings toward the biographee, though that increases the book's feeling of authenticity:\r\n\r\n\"One of Elon's greatest skills is the ability to pass off his vision as a mandate from heaven\" (p.94).\r\n\r\nThis book is an excellent testament to how belief in humanity, curiosity, intelligence, sheer force of will, luck, and karma can overcome near-impossible odds and make a tangible difference.\r\n\r\nAfter reading it, this book may provoke your surrendered existential nihilism, an existential crisis of self-comparison, or inspiration for positive change--choose wisely.\r\n\r\nP.S. I do not think I'll be reading another biography anytime soon. The information is too dense, difficult to extract, and organise.\r\n\r\n\r\n\r\n### Reference\r\n\r\n* **[Elon Musk by Walter Isaacson (2023)](https://www.simonandschuster.com.au/books/Elon-Musk/Walter-Isaacson/9781761427978)**\r\n\r\n\r\n\r\nClick **[here](https://github.com/makuharistudio/makuharistudio.github.io/blob/main/src/readings/2025-04-20.md)** for this reading page's markdown file in GitHub."
  },
  {
    "id": 1742043600,
    "title": "12 Rules for Life\r",
    "name": "12-rules-for-life",
    "author": "Jordan B. Peterson\r",
    "publisher": "Penguin Random House UK\r",
    "publisherURL": "https://www.penguin.co.uk/books/309610/12-rules-for-life-by-peterson-jordan-b/9780141988511\r",
    "photo": "../assets/readings/12-rules-for-life-by-jordan-b-peterson.png\r",
    "category": "personal development\r",
    "date": "16 March 2025\r",
    "desc": "A philosophical guide on foundational approaches to help live a better life supported with anecdotes from the author's personal life and clinical practice, science, religion, and fiction.\r",
    "tags": "[\"Personal development\", \"Philosophy\"]\r",
    "content": "![12 Rules for Life by Jordan B. Peterson](../assets/readings/12-rules-for-life-by-jordan-b-peterson.png)\r\n\r\nThis book covers 12 of the author's rules for life. Note \"The\" is purposely absent from the title, implying there are more.\r\n\r\nI list the 12 covered in this book with a short summary of each for my own reminder and ease of personal application.\r\n\r\nSuch a summary may abstract away the weight and/or worth of these rules. So I do recommend reading the actual book for more in-depth, convincing, and poetic points and examples.\r\n\r\n\r\n## Rule 1: Stand up straight with your shoulders back\r\n\r\nHigher serotonin levels with low octopamine levels characterise dominators of conflicts and hierarchies, which also begets a foundation for recurring success, and a strong physical posture reflecting the comfort from those ongoing wins.\r\n\r\nConversely, low serotonin levels with high octopamine levels characterise those that repeatedly lose conflicts, are lower in hierarchies, and are afflicted by stresses leading to feedback loops that can lead to agoraphobic behaviours and posture.\r\n\r\nA crustacean analogy, whose species long preceded humanity, discern at first sight the posture of potential mates to infer an individual's conflict and hierarchy dominance, with attraction going to those with strong postures, and those with weak ones being ignored.\r\n\r\nHumans do the same. Achieving success in human society means being able to overcome conflicts and network effectively in hierarchies. People discern and judge at first sight based on posture and other factors, to make a similar inference.\r\n\r\nSo rather than walk around with a hunched back, correct your posture, and let your serotonin levels rise.\r\n\r\n\r\n## Rule 2: Treat yourself like someone you are responsible for helping\r\n\r\nGiven that individuals have greater knowledge of themselves than others have of them, people may bear self-contempt based on knowledge of their own flaws that others do not see. This can then result in an innate tendency to care for others better than they would themselves.\r\n\r\nWhen we genuinely help others for their intended good, we typically do so with a sense of respect and responsibility. That same respect and responsibility should be applied to how we treat ourselves, regardless of the faults we know of ourselves.\r\n\r\nThe intended purpose is to adopt the right attitude to help yourself get onto a life trajectory whose benefits and pride outweigh your self-criticisms.\r\n\r\n\r\n## Rule 3: Make friends with people who want the best for you\r\n\r\nPeople are different, and whilst their actions may seem the same on the surface, the motivations behind them are not. For example, there are people who want help to rise out of their suffering, versus people who cling onto their suffering to validate their victim signalling. There are people who help others out of naivety, versus people who help others out of narcissistic malevolence.\r\n\r\nIt is easier for an individual to follow their vices, wallow in misery, and choose failure, than it is for them to shoulder the burdern of improving their conditions, even though the latter would have greater long term benefit. It takes more strength and effort to become better.\r\n\r\nSo surround yourself with those who genuinely strive for their own self-improvement, and expect for your relationships with them to not be easy. It is better than having an effortless relationship with someone who sees your self-improvement efforts as a fault.\r\n\r\n\r\n## Rule 4: Compare yourself to who you were yesterday, not to who someone else is today\r\n\r\nSpend your time questioning who you are and your obligations. Be mindful that your self-evaluations aren't so over-rationalised they render life endeavours meaningless, and also avoid the trap of undervaluing your positives and overvaluing your negatives. Also, watch how you frame things, re-framing your problems may also give you insight to an alternate course of action.\r\n\r\nTake the approach of making changes, which can be more easily accomplished by aiming small, such as doing things today that make you a bit better than the you of yesterday. It is a tactic to help avoid the scenario of aiming too large, then surrendering to the innate desire of shirking the responsibility of performing a big change. As times go on, you can slowly increase the benchmark for that change.\r\n\r\nTake that energy, time, and concern for other's progress, and spend them on improving yourself.\r\n\r\n\r\n## Rule 5: Do not let your children do anything that makes you dislike them\r\n\r\nParents have a fundamental duty to act as proxies for the real world by onboarding their children to understand socially permissible boundaries, and learn to self-regulate their own behaviour. This duty takes precedence over all other aspects of the parent-child relationship, because parental failure to properly discipline a child means the world will do it instead, and the latter may not be as patient nor kind.\r\n\r\nThe degree of social immersion can affect a person's sanity. So it is important to discourage behaviours that lead to alienation, developmental cessation, and becoming a social disgrace. Such actions include angrily crying (an act of dominance that can be dealt with via timeouts), punching / kicking / biting (unless its for self-defence), and being mentally immature.\r\n\r\nParenting is also about rewarding children for actions that will make them socially accepted and successful in the world.\r\n\r\n\r\n## Rule 6: Set your house right before you criticize the world\r\n\r\nWhen you encounter the inevitable suffering that life deals you, you have the choice to either be so outraged that you become nihilistic, resentful, and believing that your vengeance is a moral imperative to dish back out at the world. \r\n\r\nOr alternatively, you can choose to learn from the experience. This is the better attitude to take, because there's only doom if you think the world conspires against you. You can start by questioning how much you contribute to the problems in your life. \r\n\r\nIdentify the things (big and small) that you could and would change to make your life better. Deconstruct yourself, and let the harmful and unnecessary parts of yourself die.\r\n\r\nHave the humility to not blame the world, and take responsibility for your own failure. After that, you can move to doing things that you can speak honourably of.\r\n\r\n\r\n## Rule 7: Pursue what is meaningful (not what is expedient)\r\n\r\nPursuing what is expedient means selfishly following short-term gains on blind impulse. Characterised by immaturity and irresponsibility to get its way, it involves lying, cheating, stealing, deceiving, manipulating, and uses the tragedy of life to justify its morally questionable actions. Over many iterations of such pursuits, it produces a demonic character.\r\n\r\nThe antithesis of pursuing expedience is pursuing meaning, which maturely regulates its impulses in its aim towards a good that pays for the debt of one's own existence. It sacrifices the pleasures of today for a better tomorrow, and the process of doing so creates social contracts through sharing, trade, and trust, and thus increases personal reputation. By living in a manner that builds towards your greatest possible self, you can raise those around you.\r\n\r\n\r\n## Rule 8: Tell the truth--or, at least, don't lie\r\n\r\nA person makes \"life-lies\" to corrupt the world with their perception. Examples of life-lies are imposing ideologies, justifying one's own cynicism, and avoiding responsibility. Living an invisible life is another type of lie, because it suppresses one's own potential and leads to obliterating their life's meaning and realising what they could be. This is characterised by avoiding conflict, false smiling whilst doing what one is told, and not questioning authority.\r\n\r\nWillful blindness is the worst lie because it lazily drowns itself in rationalisation and refusing to admit when the lie is wrong. Speaking lies leads to a weak character, and life mows down weak characters.\r\n\r\nThe author cites Nietzsche: \"...a man's worth [ is ] determined by how much truth he could tolerate\" (p.223).\r\n\r\nIdentify discrepancies between what you do and say to identify your weaknesses when misbehaving and misspeaking. The author's technique involves dividing oneself into two parts, \"...one that spoke, and one, more detached, that paid attention and judged\" (p.205). It helps identify when you are lying, and helping to decide to tell the truth when you are unsure what to do.\r\n\r\n\r\n## Rule 9: Assume that the person you are listening to might know something you don't\r\n\r\nThe highest form of wisdom is the continual search for it, and this requires accepting that knowing what you know is nothing, because sometimes you have to change the way you understand everything. You can do this by smartly being quiet and listening in conversations. However, there are different types of conversations where listening and speaking serve different purposes.\r\n\r\nSome types of conversations do not strive for such higher wisdom. For example, participants in dominance-hierarchy conversations like politics and economy merely seek attaining victory from their perception, leading to neither side learning. Genuine conversation involves listening to others without prematurely judging, understanding what the speaker thinks of their problem, and how the speaker plans to fix it. \r\n\r\nIt is important not to \"steal\" the speaker's problem by trying to solve it, because it is something that they should solve. Even if solving the problem is the purpose, be mindful about solving it too early in the conversation, as it may be perceived as a desire to escape from the problem-solving effort of the discussion.\r\n\r\nTips from the author include outlining the previous speaker's ideas and feelings to their satisfaction of your accuracy (also for your own understanding). You can also advise the speaker what their information has done for you, how it changed your presuppositions, and think of new questions, before speaking for yourself.\r\n\r\n\r\n## Rule 10: Be precise in your speech\r\n\r\nBeing precise and specific is necessary to admit to a problem, because that is the start of the problem solving process. Thus failing to specify means to also fail to define success, failure, and yourself, which can lead to growing hatred towards the confusion and suffering from the ignored reality.\r\n\r\nPursuing such care and honesty early on even if it risks facing conflict, spares you from trouble later down the line and preserves longer term truth and peace. As a start, consciously define the conversation's topic, otherwise it risks digressing to topics on everything.\r\n\r\nCommunicate your feelings to confront those feelings, such as admitting what you want, and saying what you mean so you know clearly what you intend. Even when your efforts to be precise still result in leaving the tragedy intact, at least those efforts chase away the obscurities.\r\n\r\n\r\n## Rule 11: Do not bother children when they are skateboarding\r\n\r\nIt is important to prioritise encouraging the development of your competency, which makes you safer than efforts to overprotect you. If you are overprotected, then you are more likely to fail when something unexpected, dangerous, yet full of opportunity appears, which it inevitably does.\r\n\r\nOverprotective parenting is a pathological problem that threatens a child's enlightenment, articulation, rationality, self-determination, strength and competence. This problem is an old one, the author cites the Oedipal mother concept, but focuses on the aspect of it that involves robbing another's potential as immoral.\r\n\r\nOther than overprotective parents, people with profoundly anti-human spirits also apply ugly solutions that inhibit those chances for competency development for implementation reasons that seem like lies. The author's example is that of skatestoppers, which prevented children from skateboarding nearby and learning to be competent against danger.\r\n\r\nLet yourself and others test the limits, and to gain the strength to bring more to the table. Men toughen up by pushing themselves and pushing each other. Foster the independence of your children (and of yourself), even if it causes you emotional distress.\r\n\r\nWe all need playgrounds dangerous enough to still be challenging.\r\n\r\n**Side note**: Don't forget Rule 5. Everything in moderation.\r\n\r\n\r\n## Rule 12: Pet a cat when you encounter one in the street\r\n\r\nYour life and being (including as a static existence) requires becoming something more, or at least different, which is only possible for someone who is limited. But despite those limitations and the inevitable tribulations that life throws at you, if you pay attention even on a bad day, you may be fortunate enough to be offered small opportunities such as petting a cat or a dog. Enjoy those small moments that distract you, or make you laugh at the absurdity of existence.\r\n\r\n\r\n## Reflection\r\n\r\nThis book was name-dropped in the author's YouTube lectures and interviews, so I bought a copy to try it. It is the first non-technical book I read since university, so it was not an easy transition to go from my preferred reading of factual and \"to-the-point\" near-discussionless information, to wading through such philosophical and life-orientated lessons.\r\n\r\nAdmittedly, I nearly dropped the book early on where it discussed the difference between light and darkness, as I felt it lingered too much on that point. I powered through that and was rewarded with interesting anecdotes from the author's life and clinical practice. Being careful not to spoil, the most memorable example for me is when the author and his wife looked after a neighbour's neglected child.\r\n\r\nA part of me wished I had the knowledge in this book at an earlier age in life, but I do wonder if youthful impatience would have prevented me from reading and properly incorporating the lessons.\r\n\r\nThe book encourages you to improve your internal locus of control, by setting your mindset and life in a constructive direction. One recurring way it does this is by confronting people so corrupted by their own nihilism, that they denounce humanity whilst hiding behind a false guise of being anti-prejudice.\r\n\r\nAn excerpt:\r\n\r\n*\"Aim up. Pay attention. Fix what you can fix. Don't be arrogant in your knowledge. Strive for humility, because totalitarian pride manifests itself in intolerance, oppression, torture and death. Become aware of your own insufficiency--your cowardice, malevolence, resentment and hatred. Consider the murderousness of your own spirit before you dare accuse others, and before you attempt to repair the fabric of the world. Maybe it's not the world that's at fault. Maybe it's you. You've failed to make the mark. You've missed the target... And all of that is your contribution to the insufficiency and evil of the world. And, above all, don't lie\"* (p.198)\r\n\r\nThe book has a number of other wisdoms, but I'll list only a few of my favourites below. The rest you can read the book to discover.\r\n\r\n* The author gives arithmetic proof of the \"...genuine dominance of good over evil in the human heart\", in that people constrain evil across the generations (p.154).\r\n\r\n* If you do not know why someone did something, look at the consequences then infer the motivation.\r\n\r\n* \"If you will not reveal yourself to others, you cannot reveal yourself to yourself... It means that so much of what you could be will never be forced by necessity to come forward\" (p.212).\r\n\r\n* \"Set your ambitions, even if you are uncertain about what they should be. The better ambitions have to do with the development of character and ability, rather than status and power. Status you can lose. You carry character with you wherever you go, and it allows you to prevail against adversity\" (p.224).\r\n\r\n* \"...new genes in the central nervous system turn themselves on when an organism is placed (or places itself) in a new situation... You have to say something, go somewhere and do things to get turned on. And, if not ... you remain incomplete\" (p.212).\r\n\r\nIn summary, the book may be a difficult read for the philosophically uninitiated, but the lessons are good. Truthfully, I prefer to listen to the author's lectures and interviews. They have less content, but there's more conciseness, logical reasoning, and stronger engagement in video format.\r\n\r\n\r\n\r\n### Reference\r\n\r\n* **[12 Rules for Life by Jordan B. Peterson (2018)](https://www.penguin.co.uk/books/309610/12-rules-for-life-by-peterson-jordan-b/9780141988511)**\r\n\r\n\r\n\r\nClick **[here](https://github.com/makuharistudio/makuharistudio.github.io/blob/main/src/readings/2025-03-16.md)** for this reading page's markdown file in GitHub."
  }
]